
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>小狗钱钱 - 读书笔记 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Coming Soon.html" />
    
    
    <link rel="prev" href="Proxy Tutorial - Linode.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Dare To Know
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="Proxy Tutorial - Vultr.html">
            
                <a href="Proxy Tutorial - Vultr.html">
            
                    
                    吞下这颗红药丸 | 手把手教你科学上网
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Proxy Tutorial - Linode.html">
            
                <a href="Proxy Tutorial - Linode.html">
            
                    
                    吞下这颗红药丸 | 旧版
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="Kira and a Dog Named Money.html">
            
                <a href="Kira and a Dog Named Money.html">
            
                    
                    小狗钱钱 - 读书笔记
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="Coming Soon.html">
            
                <a href="Coming Soon.html">
            
                    
                    Coming Soon
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../onceuponatime/">
            
                <a href="../onceuponatime/">
            
                    
                    Once Upon a Time
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../onceuponatime/New Jersey.html">
            
                <a href="../onceuponatime/New Jersey.html">
            
                    
                    新泽西
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >小狗钱钱 - 读书笔记</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="kira-and-a-dog-named-money">Kira and a Dog Named Money</h1>
<h1 id="&#x300C;&#x5C0F;&#x72D7;&#x94B1;&#x94B1;&#x300D;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;">&#x300C;&#x5C0F;&#x72D7;&#x94B1;&#x94B1;&#x300D;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;</h1>
<p>&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x6458;&#x53D6;&#xFF0C;&#x6216;&#x603B;&#x7ED3;&#x81EA;<a href="https://book.douban.com/subject/1095634/" target="_blank">&#x5C0F;&#x72D7;&#x94B1;&#x94B1; (&#x8C46;&#x74E3;)</a>&#x3002;</p>
<h2 id="&#x7B2C;&#x4E00;&#x7AE0;">&#x7B2C;&#x4E00;&#x7AE0;</h2>
<p>&#x5217;&#x51FA; 10 &#x4E2A;&#x60F3;&#x53D8;&#x5BCC;&#x6709;&#x7684;&#x539F;&#x56E0;</p>
<ol>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
</ol>
<h2 id="&#x7B2C;&#x4E8C;&#x7AE0;">&#x7B2C;&#x4E8C;&#x7AE0;</h2>
<p>&#x9009;&#x62E9; 3 &#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x613F;&#x671B; </p>
<ol>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
</ol>
<blockquote>
<p>&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x5207;&#x5730;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5FC3;&#x91CC;&#x6E34;&#x671B;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x624D;&#x884C;  </p>
</blockquote>
<p>&#x4E09;&#x4EF6;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5; </p>
<ul>
<li>&#x5236;&#x4F5C;&#x68A6;&#x60F3;&#x76F8;&#x518C; - &#x901A;&#x8FC7;&#x56FE;&#x7247;&#x6765;&#x601D;&#x8003; </li>
<li>&#x60F3;&#x8C61;&#x7740;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x4E86;&#x7406;&#x60F3;&#x65F6;&#x7684;&#x60C5;&#x5F62; - &#x89C6;&#x89C9;&#x5316;</li>
<li>&#x68A6;&#x60F3;&#x50A8;&#x84C4;&#x7F50; </li>
</ul>
<blockquote>
<p>&#x300C;&#x5B66;&#x4E60;&#x5C31;&#x662F;&#x8BA4;&#x8BC6;&#x65B0;&#x89C2;&#x5FF5;&#x548C;&#x65B0;&#x60F3;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5047;&#x5982;&#x4EBA;&#x4EEC;&#x59CB;&#x7EC8;&#x4EE5;&#x540C;&#x4E00;&#x79CD;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x6765;&#x8003;&#x8651;&#x95EE;&#x9898;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x59CB;&#x7EC8;&#x53EA;&#x4F1A;&#x5F97;&#x5230;&#x540C;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x300D;   </p>
</blockquote>
<p><strong>&#x4E0D;&#x53EF;&#x53D6;&#xFF1A;&#x91CD;&#x590D;&#x76F8;&#x540C;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5374;&#x671F;&#x5F85;&#x83B7;&#x5F97;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;</strong></p>
<h2 id="&#x7B2C;&#x4E09;&#x7AE0;">&#x7B2C;&#x4E09;&#x7AE0;</h2>
<p>&#x6323;&#x94B1;&#x7684;&#x5173;&#x952E;&#xFF1A;<strong>&#x81EA;&#x4FE1;&#x7A0B;&#x5EA6;</strong></p>
<blockquote>
<p>&#x4F60;&#x7684;&#x81EA;&#x4FE1;&#x7A0B;&#x5EA6;&#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x662F;&#x5426;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x5426;&#x76F8;&#x4FE1;&#x4F60;&#x81EA;&#x5DF1;&#x3002;&#x5047;&#x5982;&#x4F60;&#x6839;&#x672C;&#x4E0D;&#x76F8;&#x4FE1;&#x4F60;&#x80FD;&#x505A;&#x5230;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x6839;&#x672C;&#x4E0D;&#x4F1A;&#x52A8;&#x624B;&#x53BB;&#x505A;&#xFF0C;&#x800C;&#x5047;&#x5982;&#x4F60;&#x4E0D;&#x5F00;&#x59CB;&#x53BB;&#x505A;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x4EC0;&#x4E48;&#x4E5F;&#x5F97;&#x4E0D;&#x5230;&#x3002;  </p>
</blockquote>
<p>&#x57F9;&#x517B;&#x81EA;&#x4FE1;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;<strong>&#x6210;&#x529F;&#x65E5;&#x8BB0;</strong></p>
<h3 id="&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x70B9;">&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x70B9;</h3>
<ol>
<li>&#x4E3A;&#x522B;&#x4EBA;&#x89E3;&#x51B3;&#x96BE;&#x9898;&#xFF0C;&#x5C31;&#x80FD;&#x6323;&#x5230;&#x94B1;</li>
<li>&#x628A;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x80FD;&#x505A;&#xFF0C;&#x548C;&#x62E5;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x4E0A;</li>
</ol>
<h2 id="&#x7B2C;&#x56DB;&#x7AE0;">&#x7B2C;&#x56DB;&#x7AE0;</h2>
<ul>
<li>&#x673A;&#x4F1A;&#x9700;&#x8981;&#x9760;&#x4E3B;&#x52A8;&#x5BFB;&#x627E;&#x624D;&#x80FD;&#x5F97;&#x5230; </li>
<li>&#x60F3;&#x6E05;&#x695A;&#x559C;&#x6B22;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x518D;&#x8003;&#x8651;&#x600E;&#x4E48;&#x9760;&#x5B83;&#x8D5A;&#x94B1; </li>
</ul>
<h3 id="&#x4E24;&#x4E2A;&#x91CD;&#x70B9;">&#x4E24;&#x4E2A;&#x91CD;&#x70B9;</h3>
<ul>
<li>&#x4E0D;&#x80FD;&#x628A;&#x5E0C;&#x671B;&#x5BC4;&#x6258;&#x5728;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x4E0A;&#xFF0C;&#x5B83;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x4F60;&#x60F3;&#x8C61;&#x5F97;&#x90A3;&#x4E48;&#x957F;&#xFF0C;&#x9700;&#x8981;&#x7ACB;&#x5373;&#x627E;&#x5BFB;&#x66FF;&#x4EE3;&#x65B9;&#x6848; </li>
<li>&#x4E00;&#x5B9A;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x56F0;&#x96BE;&#x3002;&#x987A;&#x5229;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x4EBA;&#x90FD;&#x80FD;&#x6323;&#x5230;&#x94B1;&#x3002;&#x9006;&#x5883;&#x4E2D;&#x89C1;&#x5206;&#x6653;&#x3002; </li>
</ul>
<h2 id="&#x7B2C;&#x4E94;&#x7AE0;">&#x7B2C;&#x4E94;&#x7AE0;</h2>
<blockquote>
<p>&#x603B;&#x628A;&#x65F6;&#x95F4;&#x82B1;&#x5728;&#x7D27;&#x6025;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5173;&#x6CE8;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;   </p>
</blockquote>
<h3 id="&#x4E09;&#x4E2A;&#x91CD;&#x70B9;">&#x4E09;&#x4E2A;&#x91CD;&#x70B9;</h3>
<ol>
<li>&#x56F0;&#x96BE;&#x65F6;&#x8981;&#x575A;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x9006;&#x5883;&#x4E2D;&#x575A;&#x5B9A;&#x4E0D;&#x79FB;&#x5730;&#x8D2F;&#x5F7B;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x5212; </li>
<li>&#x5728;&#x8FDB;&#x5C55;&#x975E;&#x5E38;&#x987A;&#x5229;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x8981;&#x5982;&#x662F;&#x3002;&#x559C;&#x60A6;&#x4F1A;&#x8BA9;&#x4F60;&#x5FD8;&#x8BB0;&#x81EA;&#x5DF1;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x5F53;&#x6709;&#x89C4;&#x5F8B;&#x5730;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x3010;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x673A;&#x5236;&#x6765;&#x4FDD;&#x969C;&#x7CFB;&#x7EDF;&#x4E0D;&#x53D7;&#x5916;&#x754C;&#x6270;&#x52A8;&#xFF0C;&#x5E73;&#x7A33;&#x8FD0;&#x8F6C;&#x3011;</li>
<li>&#x51B3;&#x5B9A;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x5728;72&#x5C0F;&#x65F6;&#x5185;&#x505A;&#x5B8C;&#x3010;72 or never&#x3011; </li>
</ol>
<h2 id="&#x7B2C;&#x516D;&#x7AE0;">&#x7B2C;&#x516D;&#x7AE0;</h2>
<blockquote>
<p>&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x8BA4;&#x4E3A;&#xFF0C;&#x5DE5;&#x4F5C;&#x662F;&#x8270;&#x82E6;&#x548C;&#x4EE4;&#x4EBA;&#x4E0D;&#x6109;&#x5FEB;&#x7684;&#x4E8B;&#x3002;&#x4F46;&#x53EA;&#x6709;&#x505A;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x7684;&#x4EBA;&#xFF0C;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x83B7;&#x5F97;&#x6210;&#x529F;&#x3002;   </p>
</blockquote>
<h3 id="&#x51E0;&#x4E2A;&#x5FE0;&#x544A;">&#x51E0;&#x4E2A;&#x5FE0;&#x544A;</h3>
<ol>
<li>&#x6BC1;&#x6389;&#x4FE1;&#x7528;&#x5361; - &#x4FE1;&#x7528;&#x5361;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x82B1;&#x4E0D;&#x8BE5;&#x82B1;&#x7684;&#x94B1; </li>
<li>&#x5728;&#x8BB8;&#x53EF;&#x8303;&#x56F4;&#x5185;&#x6309;&#x6700;&#x4F4E;&#x7684;&#x5206;&#x671F;&#x4ED8;&#x6B3E;&#x6570;&#x76EE;&#x652F;&#x4ED8; </li>
<li>&#x524D;&#x63D0;&#x662F;&#x5B66;&#x4F1A;&#x91CF;&#x5165;&#x4E3A;&#x51FA;&#xFF0C;&#x5426;&#x5219;&#x66F4;&#x591A;&#x7684;&#x94B1;&#x53EA;&#x4F1A;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x7684;&#x70E6;&#x607C;&#xFF0C;&#x56E0;&#x4E3A;&#x652F;&#x51FA;&#x5F80;&#x5F80;&#x4F34;&#x968F;&#x6536;&#x5165;&#x4E00;&#x540C;&#x589E;&#x957F; </li>
<li>&#x5C06;&#x6263;&#x9664;&#x751F;&#x6D3B;&#x8D39;&#x7684;&#x94B1;&#x7684;&#x4E00;&#x534A;&#x5B58;&#x4E0B;&#x6765;&#xFF0C;&#x53E6;&#x4E00;&#x534A;&#x7528;&#x4E8E;&#x652F;&#x4ED8;&#x6D88;&#x8D39;&#x8D37;&#x3002;&#x6700;&#x597D;&#x4E0D;&#x4F7F;&#x7528;&#x6D88;&#x8D39;&#x8D37;&#x3002; </li>
<li>&#x8FD9;&#x771F;&#x7684;&#x6709;&#x5FC5;&#x8981;&#x4E48; </li>
</ol>
<h2 id="&#x7B2C;&#x4E03;&#x7AE0;">&#x7B2C;&#x4E03;&#x7AE0;</h2>
<blockquote>
<p>&#x4F1A;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x4EBA;&#x53D6;&#x7B11;&#x4F60;&#xFF0C;&#x4F46;&#x4E5F;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x8BA4;&#x53EF;&#x4F60;   </p>
<p>&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x75AF;&#x72C2;&#x7684;&#x5FF5;&#x5934;&#x6BD4;&#x7B80;&#x5355;&#x7684;&#x76EE;&#x6807;&#x66F4;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x3002;&#x5F53;&#x4F60;&#x5B9A;&#x4E0B;&#x5927;&#x76EE;&#x6807;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5F97;&#x4ED8;&#x51FA;&#x6BD4;&#x522B;&#x4EBA;&#x591A;&#x5F97;&#x591A;&#x7684;&#x52AA;&#x529B;&#x3002;   </p>
</blockquote>
<p>&#x3010;&#x751F;&#x606F;&#x8D44;&#x4EA7;&#x662F;&#x4F1A;&#x4E0B;&#x86CB;&#x7684;&#x9E45;&#x3011;</p>
<blockquote>
<p>&#x8D8A;&#x628A;&#x6CE8;&#x610F;&#x529B;&#x653E;&#x5728;&#x75BC;&#x75DB;&#x4E0A;&#xFF0C;&#x5C31;&#x8D8A;&#x4F1A;&#x89C9;&#x5F97;&#x75BC;&#x3002;&#x6539;&#x6389;&#x62B1;&#x6028;&#x7684;&#x6BDB;&#x75C5;&#x3002;   </p>
</blockquote>
<h2 id="&#x7B2C;&#x5341;&#x4E00;&#x7AE0;">&#x7B2C;&#x5341;&#x4E00;&#x7AE0;</h2>
<blockquote>
<p>&#x6211;&#x73B0;&#x5728;&#x4F1A;&#x53BB;&#x8003;&#x8651;&#x5F88;&#x591A;&#x4EE5;&#x524D;&#x89C9;&#x5F97;&#x65E0;&#x6240;&#x8C13;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x7684;&#x81EA;&#x6211;&#x611F;&#x89C9;&#x7B80;&#x76F4;&#x597D;&#x6781;&#x4E86;&#x3002;&#x6211;&#x7A81;&#x7136;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x8FD9;&#x4E3B;&#x8981;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x6709;&#x4E86;&#x94B1;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x6BCF;&#x5929;&#x90FD;&#x8FC7;&#x5F97;&#x5F88;&#x5145;&#x5B9E;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x52AA;&#x529B;&#x53BB;&#x4E86;&#x89E3;&#x4E00;&#x5207;&#x65B0;&#x4E8B;&#x7269;&#x3002;&#x6211;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x601D;&#x8003;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x2014;&#x2014;&#x6211;&#x4EE5;&#x524D;&#x4ECE;&#x6CA1;&#x8FD9;&#x6837;&#x505A;&#x8FC7;&#x3002;   </p>
<p>&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x5C3D;&#x6700;&#x5927;&#x52AA;&#x529B;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x8FD9;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x53D8;&#x5316;&#x3002;&#x4EE5;&#x524D;&#x6211;&#x603B;&#x662F;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF1A;&#x201C;&#x4E00;&#x65E6;&#x6211;&#x771F;&#x7684;&#x597D;&#x597D;&#x5B66;&#x4E60;&#xFF0C;&#x62FC;&#x547D;&#x505A;&#x9898;&#xFF0C;&#x5C31;&#x80FD;&#x9A6C;&#x4E0A;&#x5F97;&#x5230;&#x597D;&#x6210;&#x7EE9;&#x3002;&#x201D;&#x73B0;&#x5728;&#x6211;&#x53D1;&#x89C9;&#x8FD9;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x81EA;&#x5DF1;&#x7528;&#x6765;&#x63A8;&#x8131;&#x7684;&#x4E00;&#x4E2A;&#x501F;&#x53E3;&#x800C;&#x5DF2;&#x3002;&#x6B64;&#x523B;&#xFF0C;&#x5F53;&#x6211;&#x771F;&#x7684;&#x4ED8;&#x51FA;&#x5168;&#x90E8;&#x52AA;&#x529B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8FD9;&#x4E2A;&#x501F;&#x53E3;&#x4E86;&#x3002;&#x6211;&#x663E;&#x9732;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x7684;&#x6F5C;&#x80FD;&#x3002;&#x6211;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8FD9;&#x4E00;&#x5207;&#x53D8;&#x5316;&#x611F;&#x5230;&#x53C8;&#x60CA;&#x8BB6;&#x53C8;&#x5174;&#x594B;&#x3002;   </p>
<p>&#x4F60;&#x5E72;&#x7684;&#x6D3B;&#x6700;&#x591A;&#x53EA;&#x503C;&#x62A5;&#x916C;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x53E6;&#x4E00;&#x534A;&#x62A5;&#x916C;&#x6E90;&#x4E8E;&#x4F60;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x5B9E;&#x65BD;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x7684;&#x52C7;&#x6C14;&#x3002;  </p>
<p>&#x4E00;&#x4E2A;&#x4EBA;&#x6323;&#x94B1;&#x7684;&#x591A;&#x5C11;&#x662F;&#x548C;&#x4ED6;&#x7684;&#x81EA;&#x4FE1;&#x5FC3;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4ED6;&#x7684;&#x7CBE;&#x529B;&#x7A76;&#x7ADF;&#x662F;&#x96C6;&#x4E2D;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF0C;&#x8FD8;&#x662F;&#x653E;&#x5230;&#x4E86;&#x4ED6;&#x529B;&#x6240;&#x4E0D;&#x80FD;&#x53CA;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x3002;&#x6CA1;&#x6709;&#x6211;&#x7684;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#x672C;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x4F1A;&#x53BB;&#x601D;&#x8003;&#x81EA;&#x5DF1;&#x9002;&#x5408;&#x5728;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x8D5A;&#x94B1;&#x3002;   </p>
</blockquote>
<h2 id="&#x7B2C;&#x5341;&#x4E8C;&#x7AE0;">&#x7B2C;&#x5341;&#x4E8C;&#x7AE0;</h2>
<blockquote>
<p>&#x94B1;&#x53EA;&#x4F1A;&#x7559;&#x5728;&#x90A3;&#x4E9B;&#x4E3A;&#x4E4B;&#x4ED8;&#x51FA;&#x52AA;&#x529B;&#x7684;&#x4EBA;&#x8EAB;&#x8FB9;&#x3002;&#x7528;&#x975E;&#x6CD5;&#x624B;&#x6BB5;&#x53D6;&#x5F97;&#x4E0D;&#x4E49;&#x4E4B;&#x8D22;&#x7684;&#x4EBA;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x6BD4;&#x6CA1;&#x94B1;&#x7684;&#x65F6;&#x5019;&#x611F;&#x89C9;&#x66F4;&#x7CDF;&#x7CD5;&#x3002;   </p>
<p>&#x8981;&#x60F3;&#x8FC7;&#x66F4;&#x5E78;&#x798F;&#x3001;&#x66F4;&#x6EE1;&#x610F;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4EBA;&#x5C31;&#x5F97;&#x6539;&#x53D8;&#x81EA;&#x8EAB;&#x3002;&#x8FD9;&#x548C;&#x94B1;&#x65E0;&#x5173;&#xFF0C;&#x91D1;&#x94B1;&#x672C;&#x8EAB;&#x65E2;&#x4E0D;&#x4F1A;&#x4F7F;&#x4EBA;&#x5E78;&#x798F;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5E26;&#x6765;&#x4E0D;&#x5E78;&#x3002;&#x91D1;&#x94B1;&#x662F;&#x4E2D;&#x6027;&#x7684;&#xFF0C;&#x65E2;&#x4E0D;&#x597D;&#xFF0C;&#x4E5F;&#x4E0D;&#x574F;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x94B1;&#x5C5E;&#x4E8E;&#x67D0;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x624D;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E2A;&#x4EBA;&#x4EA7;&#x751F;&#x597D;&#x7684;&#x5F71;&#x54CD;&#x6216;&#x8005;&#x574F;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x94B1;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x597D;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x574F;&#x7684;&#x7528;&#x9014;&#x3002;&#x4E00;&#x4E2A;&#x5E78;&#x798F;&#x7684;&#x4EBA;&#x6709;&#x4E86;&#x94B1;&#x4F1A;&#x66F4;&#x5E78;&#x798F;&#xFF1B;&#x800C;&#x4E00;&#x4E2A;&#x60B2;&#x89C2;&#x5FE7;&#x8651;&#x7684;&#x4EBA;&#xFF0C;&#x94B1;&#x8D8A;&#x591A;&#xFF0C;&#x70E6;&#x607C;&#x5C31;&#x8D8A;&#x591A;&#x3002;   </p>
<p>&#x91D1;&#x94B1;&#x4F1A;&#x66B4;&#x9732;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x672C;&#x6027;&#xFF0C;&#x201D;&#x9676;&#x7A46;&#x592A;&#x592A;&#x89E3;&#x91CA;&#x8BF4;&#xFF0C;&#x201C;&#x91D1;&#x94B1;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x653E;&#x5927;&#x955C;&#xFF0C;&#x5B83;&#x5E2E;&#x4F60;&#x66F4;&#x5145;&#x5206;&#x5730;&#x5C55;&#x73B0;&#x51FA;&#x4F60;&#x672C;&#x6765;&#x7684;&#x6837;&#x5B50;&#x3002;&#x597D;&#x4EBA;&#x53EF;&#x4EE5;&#x7528;&#x94B1;&#x505A;&#x5F88;&#x591A;&#x597D;&#x4E8B;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x76D7;&#x8D3C;&#xFF0C;&#x90A3;&#x4F60;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x628A;&#x94B1;&#x6325;&#x970D;&#x5728;&#x4E00;&#x4E9B;&#x8822;&#x4E8B;&#x4E0A;&#x3002;   </p>
<p>&#x201C;&#x5174;&#x8DA3;&#x662F;&#x6709;&#x7684;&#xFF01;&#x201D;&#x6C49;&#x5185;&#x574E;&#x666E;&#x5148;&#x751F;&#x8BC1;&#x5B9E;&#x8BF4;&#xFF0C;&#x201C;&#x4E0D;&#x8FC7;&#x5F80;&#x5F80;&#x4E5F;&#x4F34;&#x968F;&#x7740;&#x6050;&#x60E7;&#x3002;&#x4F60;&#x4EE5;&#x4E3A;&#x6211;&#x4E2D;&#x65AD;&#x4E86;&#x5B66;&#x4E1A;&#x8DD1;&#x5230;&#x4E16;&#x754C;&#x5404;&#x5730;&#xFF0C;&#x5F88;&#x8F7B;&#x677E;&#x5417;&#xFF1F;&#x6211;&#x5E38;&#x5E38;&#x611F;&#x5230;&#x4E0D;&#x5B89;&#x3002;&#x6295;&#x8EAB;&#x5546;&#x6D77;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4E5F;&#x5F88;&#x62C5;&#x5FC3;&#x3002;&#x201D;&#x4ED6;&#x7528;&#x4E00;&#x79CD;&#x6073;&#x5207;&#x7684;&#x76EE;&#x5149;&#x671B;&#x7740;&#x6211;&#xFF0C;&#x8BF4;&#xFF1A;<strong>&#x201C;&#x6211;&#x751F;&#x547D;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x6700;&#x7F8E;&#x597D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x505A;&#x4E86;&#x539F;&#x672C;&#x4E0D;&#x6562;&#x505A;&#x7684;&#x4E8B;&#x3002;&#x201D;</strong>  </p>
<p>&#x201C;&#x6700;&#x73CD;&#x8D35;&#x7684;&#x793C;&#x7269;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4E89;&#x53D6;&#x6765;&#x7684;&#x3002;&#x514B;&#x670D;&#x4E86;&#x4E22;&#x9762;&#x5B50;&#x7684;&#x6050;&#x60E7;&#xFF0C;&#x4E16;&#x754C;&#x5C31;&#x4F1A;&#x5411;&#x4F60;&#x655E;&#x5F00;&#x5927;&#x95E8;&#xFF01;&#x201D;  </p>
</blockquote>
<p>&#x3010;&#x8F93;&#x4E0D;&#x4E22;&#x4EBA;&#xFF0C;&#x6015;&#x624D;&#x4E22;&#x4EBA;&#x3011; </p>
<h2 id="&#x7B2C;&#x5341;&#x4E09;&#x7AE0;">&#x7B2C;&#x5341;&#x4E09;&#x7AE0;</h2>
<blockquote>
<p>&#x201C;&#x6211;&#x60F3;&#xFF0C;&#x4F60;&#x521A;&#x521A;&#x53C8;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;<strong>&#x505A;&#x6709;&#x94B1;&#x4EBA;&#x7684;&#x5F88;&#x597D;&#x7684;&#x7406;&#x7531;</strong>&#x3002;&#x201D;&#x94B1;&#x94B1;&#x63D0;&#x793A;&#x6211;&#x3002;&#x6211;&#x7591;&#x60D1;&#x5730;&#x671B;&#x7740;&#x5B83;&#x3002;&#x201C;&#x4F60;&#x53EF;&#x4EE5;<strong>&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x80FD;&#x529B;&#x5E2E;&#x52A9;&#x522B;&#x4EBA;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x522B;&#x4EBA;&#x4E5F;&#x4F1A;&#x76F8;&#x4FE1;&#x4F60;&#xFF0C;&#x613F;&#x610F;&#x63A5;&#x53D7;&#x4F60;&#x7684;&#x5E2E;&#x52A9;&#x3002;</strong>&#x201D;&#x94B1;&#x94B1;&#x89E3;&#x91CA;&#x8BF4;&#x3002;   </p>
<p>&#x5F53;&#x4F60;&#x53D6;&#x5F97;&#x4E00;&#x4E9B;&#x6210;&#x529F;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x8981;&#x505C;&#x6B62;&#x5199;&#x4F60;&#x7684;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;   </p>
<p>&#x201C;&#x8FD9;&#x4E0D;&#x50CF;&#x4F60;&#x73B0;&#x5728;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x201D;&#x6211;&#x542C;&#x89C1;&#x94B1;&#x94B1;&#x7528;&#x6073;&#x5207;&#x7684;&#x53E3;&#x6C14;&#x63A5;&#x7740;&#x8BF4;&#xFF0C;&#x201C;&#x6210;&#x529F;&#x4F1A;&#x4F7F;&#x4EBA;&#x9A84;&#x50B2;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9A84;&#x50B2;&#x81EA;&#x5927;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x505C;&#x6B62;&#x5B66;&#x4E60;&#x3002;&#x4E0D;&#x5B66;&#x4E60;&#xFF0C;&#x4EBA;&#x5C31;&#x4E0D;&#x4F1A;&#x518D;&#x8FDB;&#x6B65;&#x3002;&#x201D;   </p>
<p>&#x5B83;&#x505C;&#x987F;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x63A5;&#x7740;&#x8BF4;&#xFF1A;&#x201C;&#x5F53;&#x4F60;&#x5199;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x5BF9;&#x81EA;&#x5DF1;&#xFF0C;&#x5BF9;&#x4E16;&#x754C;&#xFF0C;&#x8FD8;&#x6709;&#x5BF9;&#x6210;&#x529F;&#x7684;&#x89C4;&#x5F8B;&#x4F5C;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x548C;&#x81EA;&#x5DF1;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x624D;&#x4F1A;&#x6709;&#x80FD;&#x529B;&#x53BB;&#x7406;&#x89E3;&#x522B;&#x4EBA;&#x3002;&#x5F7B;&#x5E95;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x548C;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x79D8;&#x5BC6;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x79CD;&#x7406;&#x60F3;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5730;&#x6162;&#x6162;&#x63A5;&#x8FD1;&#x8FD9;&#x79CD;&#x7406;&#x60F3;&#x3002;&#x201D;   </p>
<p><strong>&#x4F60;&#x4E0D;&#x80FD;&#x5728;&#x56F0;&#x96BE;&#x9762;&#x524D;&#x9003;&#x8DD1;&#x3002;&#x56F0;&#x96BE;&#x3001;&#x72AF;&#x9519;&#x8BEF;&#x548C;&#x4E22;&#x9762;&#x5B50;&#x5F15;&#x8D77;&#x7684;&#x6050;&#x60E7;&#x5DF2;&#x7ECF;&#x7834;&#x574F;&#x4E86;&#x65E0;&#x6570;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x3002;</strong>  </p>
<p>&#x6050;&#x60E7;&#x603B;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8BBE;&#x60F3;&#x4E8B;&#x60C5;&#x4F1A;&#x5982;&#x4F55;&#x4E0D;&#x987A;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x5931;&#x8D25;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x60F3;&#x5F97;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x4F1A;&#x8D8A;&#x5BB3;&#x6015;&#x3002;&#x800C;&#x5F53;&#x4F60;&#x770B;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#x65F6;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x90A3;&#x4E9B;&#x6210;&#x529F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x81EA;&#x7136;&#x800C;&#x7136;&#x4E5F;&#x5C31;&#x4F1A;&#x60F3;&#x5230;&#x5E94;&#x8BE5;&#x600E;&#x6837;&#x53BB;&#x505A;&#x3002;   </p>
<p>&#x5F53;&#x4F60;&#x671D;&#x7740;&#x79EF;&#x6781;&#x7684;&#x76EE;&#x6807;&#x53BB;&#x601D;&#x8003;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x5FC3;&#x751F;&#x754F;&#x60E7;&#x3002;   </p>
</blockquote>
<h2 id="&#x7B2C;&#x5341;&#x56DB;&#x7AE0;">&#x7B2C;&#x5341;&#x56DB;&#x7AE0;</h2>
<h3 id="&#x6295;&#x8D44;&#x57FA;&#x672C;&#x539F;&#x5219;">&#x6295;&#x8D44;&#x57FA;&#x672C;&#x539F;&#x5219;</h3>
<ol>
<li>&#x5E94;&#x8BE5;&#x628A;&#x94B1;&#x6295;&#x5728;&#x5B89;&#x5168;&#x7684;&#x5730;&#x65B9; </li>
<li>&#x6211;&#x7684;&#x94B1;&#x5E94;&#x8BE5;&#x4E0B;&#x5F88;&#x591A;&#x300C;&#x91D1;&#x86CB;&#x300D; </li>
<li>&#x6211;&#x4EEC;&#x7684;&#x6295;&#x8D44;&#x5E94;&#x8BE5;&#x7B80;&#x5355;&#x660E;&#x4E86; </li>
</ol>
<blockquote>
<p>&#x201C;&#x8FD9;&#x6B63;&#x662F;&#x80A1;&#x7968;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x201D;&#x8001;&#x592A;&#x592A;&#x8F7B;&#x5FEB;&#x5730;&#x8BF4;&#xFF0C;&#x201C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5F00;&#x516C;&#x53F8;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x516C;&#x53F8;&#x53C2;&#x80A1;&#x5C31;&#x884C;&#xFF0C;&#x4F60;&#x6240;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8D2D;&#x4E70;&#x516C;&#x53F8;&#x7684;&#x80A1;&#x4EFD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x80A1;&#x7968;&#x3002;&#x201D;   </p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x94B1;&#x8BA9;&#x522B;&#x4EBA;&#x66FF;&#x6211;&#x5DE5;&#x4F5C;&#x3002;   </p>
</blockquote>
<h2 id="&#x7B2C;&#x5341;&#x4E94;&#x7AE0;">&#x7B2C;&#x5341;&#x4E94;&#x7AE0;</h2>
<blockquote>
<p>&#x201C;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x505A;&#x4ECA;&#x5929;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x4E00;&#x4E9B;&#x538B;&#x529B;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x80FD;&#x591F;&#x505A;&#x5230;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x6700;&#x5F15;&#x4EE5;&#x4E3A;&#x81EA;&#x8C6A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x90A3;&#x4E9B;&#x505A;&#x8D77;&#x6765;&#x6700;&#x8270;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x4F60;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x3002;&#x201D;   </p>
</blockquote>
<h2 id="&#x7B2C;&#x5341;&#x516D;&#x7AE0;">&#x7B2C;&#x5341;&#x516D;&#x7AE0;</h2>
<p>&#x6311;&#x9009;&#x57FA;&#x91D1;&#x65F6;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF1A; </p>
<ol>
<li>&#x57FA;&#x91D1;&#x5E94;&#x8BE5;&#x81F3;&#x5C11;&#x6709;10&#x5E74;&#x5386;&#x53F2;&#x3002;&#x5047;&#x5982;&#x5B83;&#x5728;&#x8FD9;&#x4E48;&#x957F;&#x65F6;&#x95F4;&#x5185;&#x4E00;&#x76F4;&#x6709;&#x4E30;&#x539A;&#x7684;&#x5229;&#x6DA6;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#xFF0C;&#x672A;&#x6765;&#x5B83;&#x4E5F;&#x4F1A;&#x8FD0;&#x4F5C;&#x826F;&#x597D;&#x3002; </li>
<li>&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#x5927;&#x578B;&#x7684;&#x8DE8;&#x56FD;&#x80A1;&#x7968;&#x57FA;&#x91D1;&#x3002;&#x8FD9;&#x79CD;&#x57FA;&#x91D1;&#x5728;&#x4E16;&#x754C;&#x5404;&#x5730;&#x8D2D;&#x4E70;&#x80A1;&#x7968;&#xFF0C;&#x4EE5;&#x6B64;&#x5206;&#x6563;&#x98CE;&#x9669;&#xFF0C;&#x6240;&#x4EE5;&#x5341;&#x5206;&#x5B89;&#x5168;&#x3002; </li>
<li>&#x5BF9;&#x57FA;&#x91D1;&#x7684;&#x8D70;&#x52BF;&#x56FE;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x89C2;&#x5BDF;&#x5728;&#x8FC7;&#x53BB;10&#x5E74;&#x95F4;&#x54EA;&#x4E9B;&#x57FA;&#x91D1;&#x7684;&#x5E74;&#x7EC8;&#x5229;&#x6DA6;&#x6700;&#x597D;&#x3002; </li>
</ol>
<h2 id="&#x9644;&#x5F55;">&#x9644;&#x5F55;</h2>
<h3 id="&#x80A1;&#x7968;">&#x80A1;&#x7968;</h3>
<p>&#x80A1;&#x7968;&#x662F;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x80A1;&#x6743;&#x8BC1;&#x660E;&#x2014;&#x2014;&#x4F60;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x4E00;&#x4EFD;&#x6216;&#x82E5;&#x5E72;&#x4EFD;&#x80A1;&#x6743;&#x3002;&#x6BCF;&#x4E00;&#x4EFD;&#x80A1;&#x6743;&#x5C31;&#x662F;&#x4E00;&#x5F20;&#x80A1;&#x7968;&#x3002;&#x5982;&#x679C;&#x516C;&#x53F8;&#x8D62;&#x5229;&#xFF08;&#x8D5A;&#x94B1;&#xFF09;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x6240;&#x62E5;&#x6709;&#x7684;&#x80A1;&#x4EFD;&#x6570;&#x91CF;&#xFF0C;&#x4ECE;&#x516C;&#x53F8;&#x7684;&#x5229;&#x6DA6;&#x4E2D;&#x5206;&#x5F97;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4F60;&#x7684;&#x80A1;&#x4EFD;&#x8D8A;&#x5C11;&#xFF0C;&#x5206;&#x5230;&#x7684;&#x5229;&#x6DA6;&#x5C31;&#x8D8A;&#x5C11;&#xFF1B;&#x80A1;&#x4EFD;&#x8D8A;&#x591A;&#xFF0C;&#x5206;&#x5230;&#x7684;&#x5229;&#x6DA6;&#x5C31;&#x8D8A;&#x591A;&#x3002;&#x5982;&#x679C;&#x516C;&#x53F8;&#x4E8F;&#x635F;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x6240;&#x6301;&#x6709;&#x7684;&#x80A1;&#x7968;&#x5C31;&#x4F1A;&#x8D2C;&#x503C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x6025;&#x4E8E;&#x5356;&#x51FA;&#x80A1;&#x7968;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x7B49;&#x5F85;&#x516C;&#x53F8;&#x91CD;&#x65B0;&#x8D62;&#x5229;&#x3002;&#x5728;&#x7B2C;&#x5341;&#x516D;&#x7AE0;&#x4E2D;&#xFF0C;&#x9676;&#x7A46;&#x592A;&#x592A;&#x5BF9;&#x6B64;&#x6709;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x3002; </p>
<h3 id="&#x6295;&#x8D44;">&#x6295;&#x8D44;</h3>
<p>&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6295;&#x8D44;&#x662F;&#x6307;&#x901A;&#x8FC7;&#x83B7;&#x53D6;&#x5229;&#x606F;&#x4F7F;&#x94B1;&#x7684;&#x6570;&#x76EE;&#x589E;&#x52A0;&#xFF0C;&#x6BD4;&#x5982;&#x5C06;&#x94B1;&#x6295;&#x8D44;&#x4E70;&#x80A1;&#x7968;&#xFF0C;&#x6216;&#x8005;&#x5B58;&#x5165;&#x94F6;&#x884C;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x901A;&#x8FC7;&#x8D2D;&#x4E70;&#x4EFB;&#x4F55;&#x4E00;&#x4EF6;&#x65E5;&#x540E;&#x4F1A;&#x589E;&#x503C;&#x7684;&#x7269;&#x54C1;&#xFF0C;&#x6BD4;&#x5982;&#x827A;&#x672F;&#x54C1;&#x3001;&#x623F;&#x4EA7;&#x3001;&#x53E4;&#x8463;&#x7B49;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6295;&#x8D44;&#x3002; </p>
<h3 id="&#x4EA4;&#x6613;&#x6240;">&#x4EA4;&#x6613;&#x6240;</h3>
<p>&#x4EA4;&#x6613;&#x6240;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x522B;&#x7684;&#x5E02;&#x573A;&#xFF0C;&#x662F;&#x5546;&#x4EBA;&#x4EEC;&#x4E3A;&#x4E86;&#x8FDB;&#x884C;&#x5546;&#x4E1A;&#x4EA4;&#x6613;&#x800C;&#x4E3E;&#x884C;&#x5B9A;&#x671F;&#x805A;&#x4F1A;&#x7684;&#x573A;&#x6240;&#x3002;&#x4EA4;&#x6613;&#x6240;&#x6839;&#x636E;&#x5E02;&#x573A;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x5B98;&#x65B9;&#x7684;&#x4EF7;&#x683C;&#x8C03;&#x63A7;&#x4F7F;&#x4F9B;&#x5E94;&#x548C;&#x9700;&#x6C42;&#x8FBE;&#x5230;&#x5E73;&#x8861;&#x3002;&#x8BE6;&#x60C5;&#x8BF7;&#x89C1;&#x7B2C;&#x5341;&#x516D;&#x7AE0;&#x3002; </p>
<h3 id="&#x57FA;&#x91D1;">&#x57FA;&#x91D1;</h3>
<p>&#x51FA;&#x4E8E;&#x7279;&#x5B9A;&#x7528;&#x9014;&#x800C;&#x96C6;&#x4E2D;&#x7684;&#x8D44;&#x91D1;&#xFF08;&#x7279;&#x6B8A;&#x8D22;&#x4EA7;&#xFF09;&#xFF0C;&#x8BE6;&#x60C5;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;&#x5341;&#x516D;&#x7AE0;&#x3002; </p>
<h3 id="&#x62B5;&#x62BC;">&#x62B5;&#x62BC;</h3>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x62B5;&#x62BC;&#x5C31;&#x662F;&#x628A;&#x5730;&#x4EA7;&#x7B49;&#x62B5;&#x62BC;&#x54C1;&#x4F5C;&#x4E3A;&#x503A;&#x52A1;&#x62C5;&#x4FDD;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x5F53;&#x623F;&#x5B50;&#x6240;&#x6709;&#x6743;&#x4EBA;&#x8D1F;&#x503A;&#x65F6;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x62B5;&#x62BC;&#x8FD9;&#x680B;&#x623F;&#x5B50;&#xFF0C;&#x4F5C;&#x4E3A;&#x6CD5;&#x5F8B;&#x4E0A;&#x548C;&#x7ECF;&#x6D4E;&#x4E0A;&#x8FD8;&#x6B3E;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x4ED6;&#x7684;&#x5730;&#x4EA7;&#x5C31;&#x8BB0;&#x5165;&#x4E86;&#x503A;&#x6743;&#x4EBA;&#x540D;&#x4E0B;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8FD9;&#x680B;&#x623F;&#x5B50;&#x7684;&#x6240;&#x6709;&#x6743;&#x53D7;&#x5230;&#x4E86;&#x9650;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x503A;&#x52A1;&#x4EBA;&#x2014;&#x2014;&#x4E5F;&#x5C31;&#x662F;&#x623F;&#x5B50;&#x6240;&#x6709;&#x6743;&#x4EBA;&#x2014;&#x2014;&#x51FA;&#x552E;&#x4ED6;&#x7684;&#x623F;&#x5B50;&#xFF0C;&#x83B7;&#x5F97;&#x7684;&#x6536;&#x76CA;&#x5FC5;&#x987B;&#x4EA4;&#x7ED9;&#x503A;&#x6743;&#x4EBA;&#x3002; </p>
<h3 id="&#x901A;&#x8D27;&#x81A8;&#x80C0;">&#x901A;&#x8D27;&#x81A8;&#x80C0;</h3>
<p>&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x5C31;&#x662F;&#x8D27;&#x5E01;&#x8D2C;&#x503C;&#x3002;&#x73B0;&#x5728;&#x7528;5&#x9A6C;&#x514B;&#x53EF;&#x4EE5;&#x6BD4;10&#x5E74;&#x540E;&#x4E70;&#x5230;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8D27;&#x5E01;&#x7684;&#x4EF7;&#x503C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x589E;&#x957F;&#x800C;&#x4E0D;&#x65AD;&#x51CF;&#x5C11;&#x3002; </p>
<h3 id="&#x5229;&#x606F;">&#x5229;&#x606F;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x5C06;&#x8D44;&#x91D1;&#x501F;&#x7ED9;&#x94F6;&#x884C;&#xFF08;&#x5C31;&#x662F;&#x8BF4;&#x628A;&#x94B1;&#x5B58;&#x5165;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#xFF09;&#xFF0C;&#x94F6;&#x884C;&#x5C31;&#x4ED8;&#x7ED9;&#x4F60;&#x4E00;&#x5B9A;&#x7684;&#x91D1;&#x989D;&#x4F5C;&#x4E3A;&#x56DE;&#x62A5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x501F;&#x7ED9;&#x94F6;&#x884C;3000&#x9A6C;&#x514B;&#xFF0C;&#x94F6;&#x884C;&#x5C31;&#x4F1A;&#x6309;&#x4E00;&#x4E2A;&#x89C4;&#x5B9A;&#x7684;&#x5229;&#x7387;&#x2014;&#x2014;&#x6BD4;&#x5982;3%&#xFF0C;&#x4ED8;&#x7ED9;&#x4F60;&#x5229;&#x606F;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x6BCF;&#x5E74;&#x90FD;&#x4F1A;&#x5F97;&#x5230;3000&#x9A6C;&#x514B;&#x7684;3%&#xFF0C;&#x4E5F;&#x5C31;&#x662F;90&#x9A6C;&#x514B;&#x3002; </p>
<h3 id="&#x590D;&#x5229;">&#x590D;&#x5229;</h3>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x548C;&#x94F6;&#x884C;&#x7EA6;&#x5B9A;&#xFF0C;&#x6BCF;&#x5E74;&#x5E74;&#x7EC8;&#x65F6;&#x5C06;&#x5229;&#x606F;&#x8BA1;&#x5165;&#x672C;&#x91D1;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x4EE5;&#x4E0A;&#x9762;&#x7684;&#x6570;&#x5B57;&#x4E3A;&#x4F8B;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7B2C;&#x4E8C;&#x5E74;&#x7684;&#x672C;&#x91D1;&#x52A0;&#x5728;&#x4E00;&#x8D77;&#x5C31;&#x8FBE;&#x5230;&#x4E86;3090&#x9A6C;&#x514B;&#xFF0C;&#x8FD9;&#x7B14;&#x94B1;&#x53C8;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x4EA7;&#x751F;&#x5229;&#x606F;&#xFF1A;3090&#x7684;3%&#x662F;92.7&#x9A6C;&#x514B;&#x3002;&#x8FD9;&#x6837;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0B;&#x4E00;&#x5E74;&#x7684;&#x672C;&#x91D1;&#x5C31;&#x662F;&#xFF1A;3090+92.7=3182.70&#xFF08;&#x9A6C;&#x514B;&#xFF09;&#x3002;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x4E4B;&#x540E;&#x6BCF;&#x5E74;&#x90FD;&#x8FD9;&#x6837;&#x8BA1;&#x7B97;&#x3002; </p>
<h1 id="gitbookdaretoknow">gitbook/DareToKnow</h1>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Proxy Tutorial - Linode.html" class="navigation navigation-prev " aria-label="Previous page: 吞下这颗红药丸 | 旧版">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Coming Soon.html" class="navigation navigation-next " aria-label="Next page: Coming Soon">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"小狗钱钱 - 读书笔记","level":"1.2.3","depth":2,"next":{"title":"Coming Soon","level":"1.2.4","depth":2,"path":"daretoknow/Coming Soon.md","ref":"daretoknow/Coming Soon.md","articles":[]},"previous":{"title":"吞下这颗红药丸 | 旧版","level":"1.2.2","depth":2,"path":"daretoknow/Proxy Tutorial - Linode.md","ref":"daretoknow/Proxy Tutorial - Linode.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"daretoknow/Kira and a Dog Named Money.md","mtime":"2020-11-21T05:23:32.953Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-21T05:23:33.952Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

