
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>吞下这颗红药丸 | 手把手教你科学上网 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Proxy Tutorial - Linode.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Dare To Know
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="Proxy Tutorial - Vultr.html">
            
                <a href="Proxy Tutorial - Vultr.html">
            
                    
                    吞下这颗红药丸 | 手把手教你科学上网
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Proxy Tutorial - Linode.html">
            
                <a href="Proxy Tutorial - Linode.html">
            
                    
                    吞下这颗红药丸 | 旧版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="Kira and a Dog Named Money.html">
            
                <a href="Kira and a Dog Named Money.html">
            
                    
                    小狗钱钱 - 读书笔记
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="Coming Soon.html">
            
                <a href="Coming Soon.html">
            
                    
                    Coming Soon
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../onceuponatime/">
            
                <a href="../onceuponatime/">
            
                    
                    Once Upon a Time
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../onceuponatime/New Jersey.html">
            
                <a href="../onceuponatime/New Jersey.html">
            
                    
                    新泽西
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >吞下这颗红药丸 | 手把手教你科学上网</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="proxy-tutorial---vultr">Proxy Tutorial - Vultr</h1>
<h1 id="&#x541E;&#x4E0B;&#x8FD9;&#x9897;&#x7EA2;&#x836F;&#x4E38;--&#x624B;&#x628A;&#x624B;&#x6559;&#x4F60;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;">&#x541E;&#x4E0B;&#x8FD9;&#x9897;&#x7EA2;&#x836F;&#x4E38; | &#x624B;&#x628A;&#x624B;&#x6559;&#x4F60;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;</h1>
<h2 id="0-&#x524D;&#x8A00;">0. &#x524D;&#x8A00;</h2>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x5BA1;&#x67E5;&#xFF0C;&#x6807;&#x9898;&#x4E2D;&#x5C31;&#x4E0D;&#x5E26;&#x5173;&#x952E;&#x5B57;&#x4E86;&#x3002;&#x76EE;&#x524D;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x7684;&#x65B9;&#x5F0F;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x79CD;&#xFF0C;VPN &#x548C; Proxy&#xFF0C;&#x672C;&#x6587;&#x5C06;&#x6559;&#x4F60;&#x642D;&#x5EFA; Proxy&#xFF0C;&#x5373;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x3002;&#x81F3;&#x4E8E;&#x4E8C;&#x8005;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x6309;&#x672C;&#x6587;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x6CD5;&#x6210;&#x529F;&#x7FFB;&#x5899;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x884C; Google &#x4E86;&#x3002;&#x672C;&#x6587;&#x9762;&#x5411;&#x96F6;&#x57FA;&#x7840;&#x7528;&#x6237;&#xFF0C;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#x4F1A;&#x5199;&#x5F97;&#x975E;&#x5E38;&#x8BE6;&#x7EC6;&#x3002;</p>
<p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x5982;&#x4E0B;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;1. &#x57FA;&#x672C;&#x539F;&#x7406;&#x7684;&#x76F4;&#x89C2;&#x63CF;&#x8FF0;&#x3002;2. &#x79DF;&#x7528; VPS (&#x865A;&#x62DF;&#x4E13;&#x7528;&#x670D;&#x52A1;&#x5668;)&#xFF0C;&#x542B;&#x65B0;&#x7528;&#x6237;&#x5956;&#x52B1;&#x91D1;&#x3002;3. &#x5B89;&#x88C5; Shadowsocks &#x670D;&#x52A1;&#x5668;&#x7AEF;&#x3002;4. &#x5B89;&#x88C5; Shadowsocks &#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x672C;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x64CD;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x5B8C;&#x6210;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x9605;&#x8BFB;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x8BF7;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x6253;&#x5F00;&#x6587;&#x7AE0;&#x3002;&#x5982;&#x4F55;&#x505A;&#x5462;&#xFF1F;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x6536;&#x85CF;&#x6216;&#x5206;&#x4EAB;&#x672C;&#x6587;&#x3002;&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x53D1;&#x9001;&#x6587;&#x7AE0;&#x94FE;&#x63A5;&#x5230;&#x7535;&#x8111;&#xFF0C;&#x53EF;&#x4EE5;&#x7528; email&#xFF0C;&#x5FAE;&#x4FE1;&#xFF0C;&#x6216;&#x8005;&#x4FDD;&#x5B58;&#x5230;&#x7B14;&#x8BB0;&#x8F6F;&#x4EF6;&#x5982;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#xFF0C;OneNote &#x7B49;&#x3002;&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x6253;&#x5F00;&#x3002;(&#x54CE;&#x7B2C;&#x4E00;&#x6B65;&#x597D;&#x50CF;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x5B89;&#x59AE;&#x5FAE;&#xFF0C;&#x8BF7;&#x52A1;&#x5FC5;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x9605;&#x8BFB;&#x672C;&#x6587;&#x3002;)</p>
<h2 id="1-&#x57FA;&#x672C;&#x539F;&#x7406;&#x7684;&#x76F4;&#x89C2;&#x63CF;&#x8FF0;">1. &#x57FA;&#x672C;&#x539F;&#x7406;&#x7684;&#x76F4;&#x89C2;&#x63CF;&#x8FF0;</h2>
<p>&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x8FDE;&#x63A5;&#x5230; Google&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x5899;&#x5185;&#x5927;&#x558A;&#x300C;&#x6211;&#x8981;&#x4E0A;Google&#xFF01;&#x300D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5899;&#x8BC6;&#x522B;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x4E3B;&#x52A8;&#x628A;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x6321;&#x4F4F;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x7FFB;&#x8FC7;&#x8FD9;&#x9053;&#x5899;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65E0;&#x6CD5;&#x88AB;&#x5899;&#x8BC6;&#x522B;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5899;&#x5185;&#x548C;&#x5899;&#x5916;&#x5404;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x8BF4;&#x4E00;&#x79CD;&#x5899;&#x542C;&#x4E0D;&#x61C2;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x6211;&#x4EEC;&#x201C;&#x5077;&#x5077;&#x5730;&#x201D;&#x5728;&#x5899;&#x5185;&#x8DDF;&#x4EE3;&#x7406;&#x4EBA;&#x8BF4;&#x6211;&#x4EEC;&#x8981;&#x4E0A; Google&#xFF0C;&#x4ED6;&#x5C06;&#x6211;&#x4EEC;&#x8981;&#x8BF4;&#x7684;&#x8BDD;&#x7FFB;&#x8BD1;&#x6210;&#x5899;&#x542C;&#x4E0D;&#x61C2;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x4EBA;&#x558A;&#x8BDD;&#xFF0C;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x4EBA;&#x518D;&#x4E0E; Google &#x81EA;&#x7531;&#x4EA4;&#x6D41;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E5%A2%99%20%E7%A4%BA%E6%84%8F%E5%9B%BE.png" alt=""></p>
<p>&#x672C;&#x6587;&#x7684;&#x7B2C;&#x4E8C;&#x548C;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x5C06;&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x4EBA;&#x3002;&#x7B2C;&#x56DB;&#x90E8;&#x5206;&#x8D1F;&#x8D23;&#x5B89;&#x88C5;&#x548C;&#x914D;&#x7F6E;&#x5899;&#x5185;&#x7684;&#x4EE3;&#x7406;&#x4EBA;&#x3002;</p>
<h2 id="2-&#x79DF;&#x4E00;&#x53F0;&#x7535;&#x8111;">2. &#x79DF;&#x4E00;&#x53F0;&#x7535;&#x8111;</h2>
<p>&#x4EE3;&#x7406;&#x4EBA;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x7535;&#x8111;&#x7A0B;&#x5E8F;&#xFF0C;&#x7535;&#x8111;&#x7A0B;&#x5E8F;&#x81EA;&#x7136;&#x8981;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x53F0;&#x80FD;&#x5728;&#x5899;&#x5916;&#x8FD0;&#x884C;&#x7684;&#x7535;&#x8111;&#x3002;&#x5982;&#x4F55;&#x80FD;&#x641E;&#x4E00;&#x53F0;&#x5728;&#x5899;&#x5916;&#xFF0C;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x8FDC;&#x7A0B;&#x63A7;&#x5236;&#xFF0C;&#x80FD;&#x591F;&#x5168;&#x5929;&#x5019;&#x8FD0;&#x884C;&#x7684;&#x7535;&#x8111;&#x5462;&#xFF1F;
&#x6709;&#x4E00;&#x4E9B;&#x8FD9;&#x6837;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x5168;&#x7403;&#x5404;&#x5730;&#x4E70;&#x4E86;&#x5F88;&#x591A;&#x7535;&#x8111;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x7535;&#x8111;&#x79DF;&#x51FA;&#x53BB;&#x3002;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x5C31;&#x662F; VPS &#x63D0;&#x4F9B;&#x5546;&#x3002;VPS &#x4E2D;&#x7684; V &#x662F;&#x865A;&#x62DF;&#x7684;&#x610F;&#x601D;&#xFF0C;S &#x662F;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x7535;&#x8111;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x79DF;&#x6765;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x53F0;&#x865A;&#x62DF;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x90A3;&#x4E3A;&#x5565;&#x4E0D;&#x662F;&#x5B9E;&#x4F53;&#x800C;&#x662F;&#x865A;&#x62DF;&#x7684;&#x7535;&#x8111;&#x5462;&#xFF1F;&#x6309;&#x672C;&#x6587;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x6CD5;&#x6210;&#x529F;&#x7FFB;&#x5899;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x884C; Google &#x4E86;&#x3002;
VPS &#x63D0;&#x4F9B;&#x5546;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982; Linode&#xFF0C;Vultr&#xFF0C;DigitalOcean &#x548C;&#x963F;&#x91CC;&#x4E91;&#x7B49;&#x3002;&#x672C;&#x6587;&#x9009;&#x7528; Vultr&#xFF0C;5 &#x7F8E;&#x5143;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x53EF;&#x4EE5;&#x548C;&#x51E0;&#x4E2A;&#x5C0F;&#x4F19;&#x4F34;&#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x3002;&#x9AD8;&#x901F;&#xFF0C;&#x7A33;&#x5B9A;&#xFF0C;&#x4EF7;&#x683C;&#x5408;&#x7406;&#x3002;
&#x6253;&#x5F00;<a href="https://www.vultr.com/?ref=8601364-6G" target="_blank">Vultr &#x6CE8;&#x518C;&#x94FE;&#x63A5;</a>&#xFF0C;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x300C;Sign Up&#x300D;&#x8FDB;&#x884C;&#x6CE8;&#x518C;&#x3002;<strong>&#x8BF7;&#x4F7F;&#x7528;&#x672C;&#x6587;&#x63D0;&#x4F9B;&#x7684;</strong><a href="https://www.vultr.com/?ref=8601364-6G" target="_blank">&#x6CE8;&#x518C;&#x94FE;&#x63A5;</a><strong>&#x8FDB;&#x884C;&#x6CE8;&#x518C;&#xFF0C;&#x6210;&#x529F;&#x6CE8;&#x518C;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x5F97;&#x5230; 100 &#x7F8E;&#x5143;&#x7684;&#x65B0;&#x7528;&#x6237;&#x5956;&#x52B1;&#x91D1;&#xFF0C;&#x4F9B;&#x7B2C;&#x4E00;&#x4E2A;&#x6708;&#x5185;&#x968F;&#x610F;&#x4F7F;&#x7528;&#x3002;</strong></p>
<p>&#x8F93;&#x5165;&#x90AE;&#x7BB1;&#xFF0C;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#xFF0C;&#x5EFA;&#x7ACB;&#x65B0;&#x5E10;&#x53F7;&#x3002;
&#x90AE;&#x7BB1;&#x91CC;&#x5E94;&#x8BE5;&#x6536;&#x5230;&#x4E86;&#x4E00;&#x5C01;&#x6807;&#x9898;&#x4E3A;&#x300C;Welcome to <a href="http://vultr.com/" target="_blank">Vultr.com</a>&#x300D;&#x7684;&#x90AE;&#x4EF6; (&#x6CE8;&#x610F;&#x67E5;&#x770B;&#x5783;&#x573E;&#x90AE;&#x4EF6;)&#xFF0C;&#x70B9;&#x51FB;&#x9A8C;&#x8BC1;&#x90AE;&#x7BB1;&#x7684;&#x94FE;&#x63A5;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/v2-c207483879860a64c95df92f6ad4c3d4_b.jpg" alt=""></p>
<p>&#x5728;&#x5F39;&#x5F00;&#x7684; Vultr &#x7F51;&#x9875;&#x4E2D;&#x8BBE;&#x7F6E;&#x652F;&#x4ED8;&#x65B9;&#x5F0F;&#x5E76;&#x8FDB;&#x884C;&#x9996;&#x6B21;&#x5145;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4FE1;&#x7528;&#x5361;&#xFF0C;Paypal&#xFF0C;Bitcoin&#xFF0C;&#x652F;&#x4ED8;&#x5B9D;&#x6216;&#x5FAE;&#x4FE1;&#x652F;&#x4ED8;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5.jpg" alt=""></p>
<p>&#x5145;&#x503C;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5566;&#x3002;(&#x9875;&#x9762;&#x5E94;&#x8BE5;&#x81EA;&#x52A8;&#x8DF3;&#x8F6C;&#x5230;&#x4E86;&#x90E8;&#x7F72;&#x670D;&#x52A1;&#x5668;&#x7684;&#x754C;&#x9762;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7684;&#x8BDD;&#xFF0C;&#x70B9;&#x51FB;&#x5DE6;&#x4FA7;&#x83DC;&#x5355;&#x680F;&#x4E2D;&#x7684;&#x300C;Products&#x300D;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;&#x5C4F;&#x5E55;&#x53F3;&#x4FA7;&#x7684;&#x84DD;&#x8272;&#x52A0;&#x53F7;)</p>
<h3 id="21-&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;">2.1 &#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;</h3>
<p>&#x5982;&#x679C;&#x5728;&#x4E0A;&#x4E00;&#x6B65;&#x6CE8;&#x518C;&#x5E76;&#x5145;&#x503C;&#x6210;&#x529F;&#xFF0C;&#x9875;&#x9762;&#x5E94;&#x8BE5;&#x81EA;&#x52A8;&#x8DF3;&#x8F6C;&#x5230;&#x4E86;&#x90E8;&#x7F72;&#x670D;&#x52A1;&#x5668;&#x7684;&#x754C;&#x9762;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7684;&#x8BDD;&#xFF0C;&#x70B9;&#x51FB;&#x5DE6;&#x4FA7;&#x83DC;&#x5355;&#x680F;&#x4E2D;&#x7684;&#x300C;Products&#x300D;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;&#x5C4F;&#x5E55;&#x53F3;&#x4FA7;&#x7684;&#x84DD;&#x8272;&#x52A0;&#x53F7;&#x5373;&#x53EF;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%202.jpg" alt=""></p>
<p>&#x9009;&#x62E9;&#x5DE6;&#x4FA7;&#x7B2C;&#x4E00;&#x4E2A;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%203.jpg" alt=""></p>
<p>&#x9009;&#x62E9;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5728;&#x6B64;&#x5148;&#x9009;&#x62E9;&#x4F4D;&#x4E8E;&#x65E5;&#x672C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%204.jpg" alt=""></p>
<p>&#x4E3A;&#x6211;&#x4EEC;&#x79DF;&#x7684;&#x7535;&#x8111;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x6B64;&#x5148;&#x9009;&#x62E9; Ubuntu 20.04 x64 &#x7248;&#x672C;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%205.jpg" alt=""></p>
<p>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x89C4;&#x683C;&#xFF0C;&#x4EF7;&#x683C;&#x8D8A;&#x8D35;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x8D8A;&#x5F3A;&#x3002;&#x5728;&#x6B64;&#x9009;&#x62E9;&#x7B2C;&#x4E00;&#x4E2A; 25 GB SSD&#x3002;&#x6BCF;&#x6708;&#x53EA;&#x9700; 5 &#x7F8E;&#x5143;&#xFF0C;&#x62E5;&#x6709; 25G &#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5355;&#x6838; CPU&#xFF0C;1G &#x5185;&#x5B58;&#xFF0C;1000G &#x6D41;&#x91CF;&#xFF0C;&#x8DB3;&#x591F;&#x51E0;&#x4E2A;&#x4EBA;&#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x4E86;&#x3002;</p>
<p>&#x70B9;&#x51FB;&#x5C4F;&#x5E55;&#x53F3;&#x4E0B;&#x65B9;&#x7684;&#x300C;Deploy Now&#x300D;&#x90E8;&#x7F72;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5217;&#x8868;&#xFF0C;&#x7B49;&#x5F85;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x90E8;&#x7F72;&#x5B8C;&#x6210;&#xFF0C;&#x72B6;&#x6001;&#x663E;&#x793A;&#x300C;Running&#x300D;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%206.jpg" alt=""></p>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x5730;&#x79DF;&#x5230;&#x4E86;&#x4E00;&#x53F0;&#x4F4D;&#x4E8E;&#x4E1C;&#x4EAC;&#x67D0;&#x5904;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x83B7;&#x5F97;&#x4E86; 100 &#x7F8E;&#x5143;&#x5956;&#x52B1;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x5DF2;&#x7ECF;&#x5728;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x5566;&#x3002;&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;&#x7A0B;&#x5E8F;&#x3002;</p>
<h2 id="3-&#x5B89;&#x88C5;-shadowsocks-&#x670D;&#x52A1;&#x5668;-&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;">3. &#x5B89;&#x88C5; Shadowsocks &#x670D;&#x52A1;&#x5668; (&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;)</h2>
<p>Shadowsocks &#x670D;&#x52A1;&#x5668;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x4EBA;&#x5B89;&#x88C5;&#x5230;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x79DF;&#x5230;&#x7684;&#x5899;&#x5916;&#x7684;&#x7535;&#x8111;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x64CD;&#x7EB5;&#x8FD9;&#x53F0;&#x5728;&#x7F8E;&#x56FD;&#x7684;&#x7535;&#x8111;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528; SSH &#x4E0E;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x4EA4;&#x6D41;&#x3002;SSH &#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x7406;&#x89E3;&#x4E3A;&#x4E24;&#x53F0;&#x7535;&#x8111;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x79CD;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;&#x3002;</p>
<h3 id="31-ssh-&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;">3.1 SSH &#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;</h3>
<p>&#x56DE;&#x5230;&#x521A;&#x624D;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5217;&#x8868;&#x9875;&#xFF0C;&#x70B9;&#x51FB;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x5165;&#x670D;&#x52A1;&#x5668;&#x8BE6;&#x60C5;&#x9875;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%207.jpg" alt=""></p>
<p>&#x5728;&#x9875;&#x9762;&#x5DE6;&#x4E0B;&#x89D2;&#x6709;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x4EE5;&#x53CA;&#x767B;&#x5F55;&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x3002;&#x4E3A;&#x4E86;&#x540C;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x4EA4;&#x6D41;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x501F;&#x52A9;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x82F9;&#x679C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF; (macOS) &#x8BF7;&#x6253;&#x5F00; Terminal (&#x7EC8;&#x7AEF;) &#x5E94;&#x7528;&#x3002;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x5C31;&#x8BF7;&#x6253;&#x5F00; Application (&#x5E94;&#x7528;) &#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x641C;&#x7D22; Terminal&#x3002;</p>
<p>Window &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BF7;&#x8D2D;&#x4E70;&#x4E00;&#x53F0;&#x82F9;&#x679C;&#x7535;&#x8111;&#xFF0C;&#x4E0D;&#x662F;&#xFF0C;&#x8BF7;&#x6253;&#x5F00; Command Prompt &#x5E94;&#x7528;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x300C;&#x5F00;&#x59CB;&#x300D;&#x56FE;&#x6807;&#x7684;&#x53F3;&#x4FA7;&#x641C;&#x7D22;&#x6846;&#x4E2D;&#x641C;&#x7D22;<code>command prompt</code>&#x6216;<code>cmd</code>&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x3002;</p>
<p>&#x5728; Terminal &#x6216; Command Prompt &#x5E94;&#x7528;&#x4E2D;&#x8F93;&#x5165;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#xFF0C;&#x6CE8;&#x610F;&#x5C06;<code>ping</code>&#x540E;&#x9762;&#x7684;&#x6570;&#x5B57;&#x6362;&#x6210;&#x521A;&#x624D;&#x90E8;&#x7F72;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x6309;&#x56DE;&#x8F66;&#x952E;&#x6267;&#x884C;&#x3002;</p>
<pre><code>ping 45.76.114.71
</code></pre><p><code>ping</code>&#x6307;&#x4EE4;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x662F;&#x5426;&#x6B63;&#x5E38;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x6B63;&#x5F0F;&#x767B;&#x5F55;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x524D;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x5224;&#x65AD;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#x662F;&#x5426;&#x80FD;&#x591F;&#x4E0E;&#x90E8;&#x7F72;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5EFA;&#x7ACB;&#x7A33;&#x5B9A;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x8FDE;&#x63A5;&#x6B63;&#x5E38;&#x3002;&#x6309;<code>control + c</code>&#x952E;&#x7EC8;&#x6B62;&#x6D4B;&#x8BD5;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%208.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x8FDE;&#x63A5;&#x4E0D;&#x6210;&#x529F;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/v2-7ed2c810d7baf23c7878e713f4c508a0_b.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x8FDE;&#x63A5;&#x5931;&#x8D25;&#xFF0C;&#x8BF7;&#x6309;&#x7167;<strong>&#x300C;2.1 &#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x300D;</strong>&#x7684;&#x6B65;&#x9AA4;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x7528;<code>ping</code>&#x6307;&#x4EE4;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3002;&#x5982;&#x679C;&#x4F9D;&#x7136;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x76F4;&#x81F3;&#x627E;&#x5230;&#x80FD;&#x6B63;&#x5E38;&#x8FDE;&#x63A5;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4E4B;&#x540E;&#x518D;&#x5C06;&#x65E0;&#x6CD5;&#x8FDE;&#x63A5;&#x7684;&#x90A3;&#x4E9B;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x5220;&#x9664;&#x6389;&#x5C31;&#x597D;&#x4E86;&#x3002;<strong>&#x5B8C;&#x5168;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x90E8;&#x7F72;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x6D6A;&#x8D39;&#x94B1;&#xFF0C;&#x56E0;&#x4E3A; 1. &#x670D;&#x52A1;&#x5668;&#x7684;&#x6536;&#x8D39;&#x662F;&#x6309;&#x5C0F;&#x65F6;&#x8BA1;&#x7684;&#xFF0C;&#x4E00;&#x4E2A; 5 &#x7F8E;&#x5143;/&#x6708;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6BCF;&#x5C0F;&#x65F6;&#x4EC5;&#x9700; 0.007 &#x7F8E;&#x5143;&#x3002;2. &#x5982;&#x679C;&#x4F7F;&#x7528;&#x672C;&#x6587;&#x63D0;&#x4F9B;&#x7684;</strong><a href="https://www.vultr.com/?ref=8601364-6G" target="_blank">&#x94FE;&#x63A5;&#x6CE8;&#x518C;</a><strong>&#xFF0C;&#x4F1A;&#x6709; 100 &#x7F8E;&#x5143;&#x7684;&#x65B0;&#x7528;&#x6237;&#x5956;&#x52B1;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x6708;&#x5185;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x4F7F;&#x7528;&#x3002;</strong></p>
<p>&#x8981;&#x5220;&#x6389;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x53EA;&#x9700;&#x5728;&#x670D;&#x52A1;&#x5668;&#x5217;&#x8868;&#x53F3;&#x4FA7;&#x6253;&#x5F00;&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#xFF0C;&#x70B9;&#x51FB;&#x300C;Server Destroy&#x300D;&#xFF0C;&#x7136;&#x540E;&#x4E8C;&#x6B21;&#x786E;&#x8BA4;&#x5373;&#x53EF;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%209.jpg" alt=""></p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/v2-fa298a9f958474c8a66c99fcf01b7020_b.jpg" alt=""></p>
<p>&#x786E;&#x8BA4;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6B63;&#x5F0F;&#x767B;&#x5F55;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E86;&#x3002;
&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x82F9;&#x679C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x56DE;&#x5230;&#x521A;&#x624D;&#x7684; Terminal (&#x7EC8;&#x7AEF;) &#x5E94;&#x7528;&#xFF0C;&#x8FDB;&#x884C;&#x540E;&#x7EED;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F; Window &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x767E;&#x5EA6;&#x7ECF;&#x9A8C;<a href="https://jingyan.baidu.com/article/90bc8fc8b9bca1f653640ca5.html" target="_blank">PuTTY &#x5B89;&#x88C5;&#x53CA;&#x4F7F;&#x7528;&#x6559;&#x7A0B;</a>&#x3002;</p>
<p>&#x5728; Terminal (&#x7EC8;&#x7AEF;) &#x5E94;&#x7528;&#x4E2D;&#x8F93;&#x5165;&#x4E0B;&#x9762;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x3002;&#x6CE8;&#x610F;&#x628A;<code>@</code>&#x540E;&#x9762;&#x7684;&#x6570;&#x5B57;&#x6362;&#x6210;&#x81EA;&#x5DF1;&#x670D;&#x52A1;&#x5668;&#x7684; IP &#x5730;&#x5740;&#x3002;&#x6309;&#x56DE;&#x8F66;&#x6267;&#x884C;&#x3002;</p>
<pre><code>ssh root@45.76.216.218
</code></pre><p>&#x7136;&#x540E;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x5982;&#x4E0B;&#x7684;&#x753B;&#x9762;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5.png" alt=""></p>
<p>&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x8BD5;&#x56FE;&#x767B;&#x5F55;&#x5230;&#x8FD9;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7535;&#x8111;&#x5F88;&#x8C28;&#x614E;&#x5730;&#x95EE;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x8981;&#x7EE7;&#x7EED;&#xFF0C;&#x8F93;&#x5165;<code>yes</code>&#xFF0C;&#x6309;&#x56DE;&#x8F66;&#x952E;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%202.png" alt=""></p>
<p>&#x7136;&#x540E;&#x8F93;&#x5165;&#x670D;&#x52A1;&#x5668;&#x8BE6;&#x60C5;&#x9875;&#x53F3;&#x4E0B;&#x89D2;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x5EFA;&#x8BAE;&#x901A;&#x8FC7;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x65F6;&#x5BC6;&#x7801;&#x4E0D;&#x4F1A;&#x88AB;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x4E0D;&#x5FC5;&#x5728;&#x610F;&#xFF0C;&#x53EA;&#x7BA1;&#x8F93;&#x5165;&#x5C31;&#x597D;&#x3002;&#x6309;&#x56DE;&#x8F66;&#x786E;&#x8BA4;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/v2-7720bb3bfb8ba5670ee60c3ace52e5e3_b.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;<a href="https://jingyan.baidu.com/article/90bc8fc8b9bca1f653640ca5.html" target="_blank">&#x767E;&#x5EA6;&#x7ECF;&#x9A8C;&#x6559;&#x7A0B;</a>&#xFF0C;&#x5728;&#x7B2C; 4 &#x6B65;&#x4E2D;&#x586B;&#x5165; IP &#x5730;&#x5740;&#xFF0C;Port &#x4E00;&#x9879;&#x586B; 22&#x3002; &#x5E76;&#x5728;&#x7B2C; 7 &#x6B65;&#x4E2D;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x3002;</p>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x7528; SSH &#x8FDE;&#x63A5;&#x5230;&#x5899;&#x5916;&#x7684;&#x90A3;&#x53F0;&#x7535;&#x8111;&#x4E86;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x9ED1;&#x8272;&#x80CC;&#x666F;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x4E0A;&#x9762;&#x6709;&#x4E00;&#x884C;&#x884C;&#x7684;&#x82F1;&#x6587;&#x548C;&#x6570;&#x5B57;&#xFF0C;&#x6700;&#x4E0B;&#x9762;&#x4E00;&#x884C;&#x662F;&#x8FD9;&#x6837;&#x663E;&#x793A;&#x7684;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%203.png" alt=""></p>
<p>root &#x662F;&#x6211;&#x4EEC;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x6700;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x5F62;&#x7684;&#x5149;&#x6807;&#xFF0C;&#x7528;&#x4E8E;&#x8F93;&#x5165;&#x6307;&#x4EE4;&#x3002;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x6309;&#x51E0;&#x4E0B;&#x56DE;&#x8F66;&#x5C4F;&#x5E55;&#x5C31;&#x8DF3;&#x5230;&#x6700;&#x4E0B;&#x4E00;&#x884C;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x6B64;&#x8F93;&#x5165;&#x4E00;&#x4E9B;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x90FD;&#x662F;&#x53D1;&#x9001;&#x7ED9;&#x5899;&#x5916;&#x7684;&#x90A3;&#x53F0;&#x7535;&#x8111;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x90FD;&#x4F1A;&#x88AB;&#x5355;&#x72EC;&#x653E;&#x5728;&#x4E00;&#x884C;&#xFF0C;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x8F93;&#x5165;&#x4E5F;&#x53EF;&#x4EE5;&#x590D;&#x5236;&#x7C98;&#x8D34;&#xFF0C;&#x6307;&#x4EE4;&#x524D;&#x540E;&#x4E0D;&#x9700;&#x8981;&#x7A7A;&#x683C;&#xFF0C;&#x6309;&#x56DE;&#x8F66;&#x952E;&#x6267;&#x884C;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x8F93;&#x5165;&#x5E76;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;</p>
<pre><code>apt-get update &amp;&amp; apt-get upgrade
</code></pre><p>&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x7535;&#x8111;&#x6267;&#x884C;&#x4E86;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#x4F60;&#x662F;&#x5426;&#x8981;&#x7EE7;&#x7EED;&#xFF1F;&#x5E76;&#x7ED9;&#x4E86;&#x4F60;&#x4E24;&#x4E2A;&#x9009;&#x9879; <code>Y/n</code> &#x4EE3;&#x8868;&#x662F;&#x548C;&#x5426;&#x3002;&#x8F93;&#x5165;<code>y</code>&#x5E76;&#x6309;&#x56DE;&#x8F66;&#x952E;&#x786E;&#x8BA4;&#xFF0C;&#x5927;&#x5C0F;&#x5199;&#x65E0;&#x6240;&#x8C13;&#x3002;&#x7136;&#x540E;&#x53C8;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x884C;&#x884C;&#x6587;&#x5B57;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x95EA;&#x8FC7;&#xFF0C;&#x5F88;&#x50CF;&#x7535;&#x5F71;&#x91CC;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x7684;&#x9ED1;&#x5BA2;&#x64CD;&#x4F5C;&#x7535;&#x8111;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x7684;&#x955C;&#x5934;&#xFF0C;&#x4F60;&#x5C31;&#x77E5;&#x9053;&#x8FD9;&#x6CA1;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x7684;&#x3002;&#x7528;&#x6307;&#x4EE4;&#x6765;&#x64CD;&#x4F5C;&#x7535;&#x8111;&#x5E76;&#x4E0D;&#x6BD4;&#x7528;&#x9F20;&#x6807;&#x64CD;&#x4F5C;&#x66F4;&#x9AD8;&#x7EA7;&#x3002;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x662F;&#x4E0B;&#x8F7D;&#x5E76;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x66F4;&#x65B0;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x8F6F;&#x4EF6;&#x7A33;&#x5B9A;&#x4E0E;&#x5B89;&#x5168;&#x7684;&#x8FD0;&#x884C;&#x3002;&#x6700;&#x597D;&#x65F6;&#x4E0D;&#x65F6;&#x6267;&#x884C;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#xFF0C;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;&#x54C8;&#x54C8;&#x6307;&#x4EE4;&#x3002;</p>
<pre><code>haha
</code></pre><p>&#x5C4F;&#x5E55;&#x4F1A;&#x8FD9;&#x6837;&#x663E;&#x793A;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/v2-e1ca453ebf5eeb99f19e7598c719db41_b.jpg" alt=""></p>
<p>&#x8FD9;&#x4EE3;&#x8868;&#x7535;&#x8111;&#x5E76;&#x4E0D;&#x80FD;&#x8BC6;&#x522B;&#x54C8;&#x54C8;&#x6307;&#x4EE4;&#x3002;&#x54C8;&#x54C8;&#x6307;&#x4EE4;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x5F53;&#x4F60;&#x8F93;&#x9519;&#x6307;&#x4EE4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7535;&#x8111;&#x5C31;&#x4F1A;&#x8BF4;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#xFF0C;&#x4E0D;&#x7528;&#x7D27;&#x5F20;&#xFF0C;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x6307;&#x4EE4;&#x7684;&#x62FC;&#x5199;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x526A;&#x5207;&#x7C98;&#x8D34;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x91CD;&#x65B0;&#x8F93;&#x5165;&#x5E76;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x3002;&#x597D;&#x7684;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x90FD;&#x662F;&#x771F;&#x6307;&#x4EE4;&#x4E86;&#x3002;</p>
<h3 id="32-&#x5B89;&#x88C5;-shadowsocks-&#x670D;&#x52A1;&#x5668;---&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;">3.2 &#x5B89;&#x88C5; Shadowsocks &#x670D;&#x52A1;&#x5668; - &#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;</h3>
<p>Shadowsocks &#x6709;&#x591A;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x4EE5;&#x53BB; Github &#x641C;&#x7D22; Shadowsocks&#x3002;&#x6709;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x5B89;&#x88C5; Shadowsocks &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x4E2A;&#x53EB;&#x79CB;&#x6C34;&#x9038;&#x51B0;&#x7684;&#x4EBA;&#x5236;&#x4F5C;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x5B89;&#x88C5; Shadowsocks &#x7684;&#x7535;&#x8111;&#x7A0B;&#x5E8F;&#x3002;&#x611F;&#x8C22;&#x79CB;&#x6C34;&#x9038;&#x51B0;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x53BB;<a href="https://teddysun.com/" target="_blank">&#x4ED6;&#x7684;&#x535A;&#x5BA2; (&#x9700;&#x7FFB;&#x5899;)</a>&#x901B;&#x901B;&#x3002;</p>
<p>&#x8F93;&#x5165;&#x5E76;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x884C;&#x6307;&#x4EE4;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x662F;&#x4E00;&#x884C;&#x6307;&#x4EE4;&#xFF0C;&#x4E2D;&#x95F4;&#x4E0D;&#x8981;&#x6709;&#x6362;&#x884C;&#x3002;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>shadowsocks-all.sh</code>&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x662F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x300C;&#x4E00;&#x952E;&#x5B89;&#x88C5;&#x300D;Shadowsocks &#x670D;&#x52A1;&#x5668;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<pre><code>wget &#x2014;no-check-certificate -O shadowsocks-all.sh https://raw.githubusercontent.com/teddysun/shadowsocks_install/master/shadowsocks-all.sh
</code></pre><p>&#x7136;&#x540E;&#x662F;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;</p>
<pre><code>chmod +x shadowsocks-all.sh
</code></pre><p>&#x518D;&#x63A5;&#x518D;&#x5389;&#xFF0C;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x5C06;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x5B89;&#x88C5; Shadowsocks &#x670D;&#x52A1;&#x5668;</p>
<pre><code>./shadowsocks-all.sh 2&gt;&amp;1 | tee shadowsocks-all.log
</code></pre><p>&#x5C4F;&#x5E55;&#x4E0A;&#x4F1A;&#x4F9D;&#x6B21;&#x51FA;&#x73B0;&#x63D0;&#x793A;&#x8BED;&#x548C;&#x5B89;&#x88C5;&#x9009;&#x9879;&#xFF0C;&#x8F93;&#x5165;&#x6570;&#x5B57;&#x9009;&#x62E9;&#x76F8;&#x5E94;&#x7684;&#x9009;&#x9879;&#x5E76;&#x6309;&#x56DE;&#x8F66;&#x786E;&#x8BA4;&#x5373;&#x53EF;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4E3A; Shadowsocks &#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x5BC6;&#x7801;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BC6;&#x7801;&#x662F;&#x533A;&#x522B;&#x4E8E; SSH &#x8FDC;&#x7A0B;&#x767B;&#x5F55;&#x5BC6;&#x7801;&#x7684;&#xFF0C;SSH &#x5BC6;&#x7801;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x5899;&#x5185;&#x5916;&#x4E24;&#x53F0;&#x7535;&#x8111;&#xFF0C;Shadowsocks &#x5BC6;&#x7801;&#x7528;&#x4E8E;&#x5899;&#x5185;&#x5916;&#x4E24;&#x4E2A;&#x4EE3;&#x7406;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#x3002;&#x5B89;&#x88C5;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#x7684; Shadowsocks &#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x672C;&#x6587;&#x4EE5; Shadowsocks-Python &#x4E3A;&#x4F8B;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%2010.jpg" alt=""></p>
<p>&#x8010;&#x5FC3;&#x7B49;&#x5F85; Shadowsocks &#x5B89;&#x88C5;&#x5B8C;&#x6BD5;&#x3002;&#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5C4F;&#x5E55;&#x4E0A;&#x4F1A;&#x5C55;&#x793A; Shadowsocks &#x670D;&#x52A1;&#x5668;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x6211;&#x4EEC;&#x5B89;&#x88C5; Shadowsocks &#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%2011.jpg" alt=""></p>
<p>&#x597D;&#x7684;&#xFF0C;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x4EBA;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x5728;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x56DB;&#x4E2A;&#x6307;&#x4EE4;&#x5206;&#x522B;&#x7528;&#x4E8E; Shadowsocks &#x670D;&#x52A1;&#x5668;&#x7684;&#xFF1A;&#x542F;&#x52A8;&#xFF0C;&#x505C;&#x6B62;&#xFF0C;&#x91CD;&#x542F;&#x548C;&#x67E5;&#x770B;&#x72B6;&#x6001;</p>
<pre><code>/etc/init.d/shadowsocks-python start
/etc/init.d/shadowsocks-python stop
/etc/init.d/shadowsocks-python restart
/etc/init.d/shadowsocks-python status
</code></pre><p>&#x5982;&#x679C;&#x60F3;&#x5B89;&#x88C5;&#x591A;&#x4E2A;&#x7248;&#x672C;&#x7684; Shadowsocks &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x591A;&#x6B21;&#x8FD0;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x5B89;&#x88C5;&#x6307;&#x4EE4;&#x5373;&#x53EF;</p>
<pre><code>./shadowsocks-all.sh 2&gt;&amp;1 | tee shadowsocks-all.log
</code></pre><p>&#x5982;&#x679C;&#x60F3;&#x8981;&#x5378;&#x8F7D; Shadowsocks &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x5E76;&#x9009;&#x62E9;&#x60F3;&#x8981;&#x5378;&#x8F7D;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<pre><code>./shadowsocks-all.sh uninstall
</code></pre><h3 id="33-&#x5F00;&#x542F;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#x4E0E;&#x5176;&#x4ED6;&#x4EBA;&#x5206;&#x4EAB;-&#x975E;&#x5FC5;&#x987B;">3.3 &#x5F00;&#x542F;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#x4E0E;&#x5176;&#x4ED6;&#x4EBA;&#x5206;&#x4EAB; (&#x975E;&#x5FC5;&#x987B;)</h3>
<p>&#x5982;&#x679C;&#x9700;&#x8981;&#x548C;&#x591A;&#x4E2A;&#x4EBA;&#x5206;&#x4EAB;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#x548C;&#x5BC6;&#x7801;&#x3002;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x66F4;&#x6539;&#x4E00;&#x4E0B; Shadowsocks &#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x3002;<code>config.json</code>&#x5C31;&#x662F; Shadowsocks &#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x7528;<code>nano</code>&#x8FD9;&#x4E2A;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x3002;</p>
<pre><code>nano /etc/shadowsocks-python/config.json
</code></pre><p>&#x5C4F;&#x5E55;&#x4E0A;&#x4F1A;&#x76F4;&#x63A5;&#x663E;&#x793A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x5F62;&#x7684;&#x5149;&#x6807;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;&#xFF0C;&#x5C4F;&#x5E55;&#x4E0B;&#x65B9;&#x6709;&#x4E00;&#x4E9B;&#x9009;&#x9879;&#x3002;&#x6309;&#x65B9;&#x5411;&#x952E;&#x79FB;&#x52A8;&#x5149;&#x6807;&#xFF0C;&#x50CF;&#x5176;&#x4ED6;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x4E00;&#x6837;&#x6B63;&#x5E38;&#x8F93;&#x5165;&#x548C;&#x5220;&#x9664;&#x6587;&#x672C;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x76EE;&#x524D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;<code>server_port</code>&#x548C;&#x4E00;&#x4E2A;<code>password</code>&#x3002;&#x5220;&#x9664;&#x8FD9;&#x4E24;&#x884C;&#xFF0C;&#x5E76;&#x589E;&#x52A0;<code>port_password</code>&#x3002;&#x5C06;&#x6587;&#x4EF6;&#x6539;&#x4E3A;&#x5982;&#x4E0B;&#x7684;&#x683C;&#x5F0F;</p>
<pre><code>{
    &#x201C;server&#x201D;:&#x201D;0.0.0.0&#x201D;,
    &#x201C;port_password&#x201D;: {
        &#x201C;1111&#x201D;:&#x201D;password1&#x201D;,
        &#x201C;2222&#x201D;:&#x201D;password2&#x201D;
    },
    &#x201C;local_address&#x201D;:&#x201D;127.0.0.1&#x201D;,
    &#x201C;local_port&#x201D;:1080,
    &#x201C;timeout&#x201D;:300,
    &#x201C;method&#x201D;:&#x201D;aes-256-cfb&#x201D;,
    &#x201C;fast_open&#x201D;:true
}
</code></pre><p>&#x6CE8;&#x610F;&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#xFF0C;<code>port_password</code>&#x5BF9;&#x5E94;&#x4E86;&#x4E00;&#x5BF9;&#x5927;&#x62EC;&#x53F7;&#xFF0C;&#x91CC;&#x9762;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x6DFB;&#x52A0;&#x7684;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#x548C;&#x6BCF;&#x4E2A;&#x7AEF;&#x53E3;&#x5BF9;&#x5E94;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x4E0D;&#x540C;&#x7AEF;&#x53E3;&#x548C;&#x5BC6;&#x7801;&#x4E4B;&#x95F4;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#x3002; &#x6539;&#x597D;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x6309;<code>control</code>&#x52A0;<code>x</code>&#x952E;&#x9000;&#x51FA;&#xFF0C;&#x8F93;&#x5165;<code>y</code>&#xFF0C;&#x56DE;&#x8F66;&#x4FDD;&#x5B58;&#x3002; &#x4E4B;&#x540E;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x91CD;&#x542F; Shadowsocks &#x670D;&#x52A1;&#x5668;&#x3002;</p>
<pre><code>/etc/init.d/shadowsocks-python restart
</code></pre><p>&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x914D;&#x7F6E;&#x597D;&#x4E86;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x4EBA;&#xFF0C;&#x53EA;&#x9700;&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x4E86;&#xFF0C;&#x6709;&#x70B9;&#x6FC0;&#x52A8;&#x3002;</p>
<h2 id="4-&#x5B89;&#x88C5;-shadowsocks-&#x5BA2;&#x6237;&#x7AEF;---&#x5899;&#x5185;&#x4EE3;&#x7406;&#x4EBA;">4. &#x5B89;&#x88C5; Shadowsocks &#x5BA2;&#x6237;&#x7AEF; - &#x5899;&#x5185;&#x4EE3;&#x7406;&#x4EBA;</h2>
<p>&#x6211;&#x4EEC;&#x5B89;&#x88C5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684; Shadowsocks &#x7248;&#x672C;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x4E0E;&#x624B;&#x673A;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7248;&#x672C;&#x76F8;&#x540C;&#x3002;&#x672C;&#x6587;&#x4EE5; Shadowsocks &#x666E;&#x901A;&#x7248;&#x4E3A;&#x4F8B;&#x3002;&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x8F93;&#x5165;&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;&#x7684;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E; (&#x670D;&#x52A1;&#x5668;&#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x5C4F;&#x5E55;&#x5C55;&#x793A;&#x7684;&#x7EA2;&#x8272;&#x5B57;&#x90E8;&#x5206;)&#xFF0C;&#x597D;&#x8BA9;&#x4E24;&#x4E2A;&#x4EE3;&#x7406;&#x4EBA;&#x4E4B;&#x95F4;&#x80FD;&#x4EA4;&#x6D41;&#x3002;</p>
<h3 id="41-mac-&#x7535;&#x8111;">4.1 Mac &#x7535;&#x8111;</h3>
<p>&#x6253;&#x5F00; Shadowsocks<a href="https://github.com/shadowsocks/ShadowsocksX-NG/releases" target="_blank">&#x4E0B;&#x8F7D;&#x5730;&#x5740;</a>&#x3002;&#x70B9;&#x51FB;&#x4E0B;&#x8F7D;&#x6700;&#x65B0;&#x7248;&#x672C; (&#x5E26;&#x6709;<code>Latest release</code>&#x6807;&#x8BC6;)&#x7684; ShadowsocksX-NG &#x6587;&#x4EF6;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%2012.jpg" alt=""></p>
<p>&#x89E3;&#x538B; zip &#x6587;&#x4EF6;&#x540E;&#x5C06;<code>ShadowsocksX-NG.app</code>&#x6587;&#x4EF6;&#x79FB;&#x5230; Application (&#x5E94;&#x7528;) &#x6587;&#x4EF6;&#x5939;&#x91CC;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E86;&#x3002; &#x8FD0;&#x884C;&#x5E94;&#x7528;&#x540E;&#xFF0C;&#x70B9;&#x51FB;&#x5C4F;&#x5E55;&#x6700;&#x4E0A;&#x65B9;&#x72B6;&#x6001;&#x680F;&#x7684;&#x300C;&#x5C0F;&#x98DE;&#x673A;&#x300D;&#x56FE;&#x6807;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#x4E2D;&#x9009;&#x62E9;&#x300C;&#x670D;&#x52A1;&#x5668; -&gt; &#x670D;&#x52A1;&#x5668;&#x8BBE;&#x7F6E;&#x300D;&#x3002;&#x5728;&#x7A97;&#x53E3;&#x53F3;&#x4E0B;&#x89D2;&#x70B9;&#x51FB;&#x300C;+&#x300D;&#x53F7;&#x6309;&#x94AE;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8F93;&#x5165;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5C31;&#x662F;&#x521A;&#x624D;&#x622A;&#x56FE;&#x4E2D;&#x7EA2;&#x8272;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5206;&#x522B;&#x662F; IP &#x5730;&#x5740;&#x3001;Port &#x7AEF;&#x53E3;&#x3001;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#x548C;&#x5BC6;&#x7801;&#x56DB;&#x9879;&#x3002;</p>
<p><img src="Proxy%20Tutorial%20-%20Vultr/v2-8c8f83ac61a3d2883525aefea0207ac7_b.jpg" alt=""></p>
<p>&#x586B;&#x597D;&#x540E;&#x6309;&#x786E;&#x5B9A;&#x4FDD;&#x5B58;&#x3002; &#x5728;&#x5C0F;&#x98DE;&#x673A;&#x7684;&#x4E3B;&#x83DC;&#x5355;&#x4E2D;&#x9009;&#x62E9;&#x5F00;&#x542F;&#x6216;&#x5173;&#x95ED; Shadowsocks&#x3002;</p>
<h3 id="42-windows-&#x7535;&#x8111;">4.2 Windows &#x7535;&#x8111;</h3>
<p>&#x6253;&#x5F00; Shadowsocks<a href="https://github.com/shadowsocks/shadowsocks-windows/releases" target="_blank">&#x4E0B;&#x8F7D;&#x5730;&#x5740;</a>&#x3002;&#x4E0B;&#x8F7D;&#x6700;&#x65B0;&#x7248;&#x672C; (&#x5E26;&#x6709;<code>Latest release</code>&#x6807;&#x8BC6;) &#x7684;<code>shadowsocks zip</code>&#x6587;&#x4EF6;&#xFF0C;&#x89E3;&#x538B;&#x7F29;&#x540E;&#x5C06; Shadowsocks.exe &#x6587;&#x4EF6;&#x79FB;&#x5230;&#x4E00;&#x4E2A;&#x5168;&#x82F1;&#x6587;&#x7684;&#x8DEF;&#x5F84;&#x4E0B; (&#x4F8B;&#x5982; C:\Program Files\Shadowsocks.exe)&#xFF0C;&#x7136;&#x540E;&#x7528;&#x7BA1;&#x7406;&#x5458;&#x6743;&#x9650;&#x8FD0;&#x884C; (&#x9F20;&#x6807;&#x53F3;&#x952E; -&gt; &#x7528;&#x7BA1;&#x7406;&#x5458;&#x6743;&#x9650;&#x8FD0;&#x884C; / Run as administrator)&#x3002;&#x6DFB;&#x52A0;&#x5E76;&#x914D;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x53C2;&#x6570; (&#x540C;&#x4E0A;)&#x3002;&#x53F3;&#x4E0B;&#x89D2;&#x7684;&#x7CFB;&#x7EDF;&#x5DE5;&#x5177;&#x680F;&#x91CC;&#x4F1A;&#x51FA;&#x73B0;&#x300C;&#x5C0F;&#x98DE;&#x673A;&#x300D;&#x56FE;&#x6807;&#xFF0C;&#x53F3;&#x952E;&#x53EF;&#x4EE5;&#x6253;&#x5F00; Shadowsocks &#x7684;&#x83DC;&#x5355;&#x3002;</p>
<h3 id="43-ios">4.3 iOS</h3>
<p>&#x4ECE;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x4E2D;&#x4E0B;&#x8F7D; Potatso Lite&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x82F9;&#x679C;&#x5DF2;&#x7ECF;&#x5C06;&#x6240;&#x6709;&#x7684; VPN &#x7C7B; APP &#x4ECE;&#x4E2D;&#x56FD;&#x7684;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x4E2D;&#x79FB;&#x9664;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x641C;&#x7D22;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A; app&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5C06;&#x82F9;&#x679C;&#x5E10;&#x53F7;&#x7684;&#x300C;&#x56FD;&#x5BB6;/&#x5730;&#x533A;&#x300D;&#x6539;&#x6210;&#x7F8E;&#x56FD;&#xFF0C;&#x66F4;&#x6539;&#x7684;&#x65B9;&#x5F0F;&#x8BF7;&#x53C2;&#x8003;<a href="https://support.apple.com/zh-cn/HT201389" target="_blank">&#x82F9;&#x679C;&#x5B98;&#x65B9;&#x6280;&#x672F;&#x652F;&#x6301;</a>&#x3002; &#x6253;&#x5F00; Potatso Lite &#x540E;&#xFF0C;&#x76F4;&#x63A5;&#x6DFB;&#x52A0; proxy&#xFF0C;&#x9009;&#x62E9;&#x624B;&#x52A8;&#x6DFB;&#x52A0;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x5165;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x9996;&#x6B21;&#x5F00;&#x542F;&#x65F6;&#xFF0C;&#x624B;&#x673A;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#x4F60;&#x662F;&#x5426;&#x5F00;&#x542F; vpn &#x6743;&#x9650;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x3002;&#x5F00;&#x542F; shadowsocks &#x65F6;&#x624B;&#x673A;&#x6700;&#x4E0A;&#x65B9;&#x7684;&#x72B6;&#x6001;&#x680F;&#x5E94;&#x8BE5;&#x4F1A;&#x51FA;&#x73B0; vpn &#x7684;&#x5C0F;&#x56FE;&#x6807;&#x3002;</p>
<h3 id="44-android">4.4 Android</h3>
<p>&#x7528;&#x624B;&#x673A;&#x6D4F;&#x89C8;&#x5668;&#x6253;&#x5F00; Shadowsocks<a href="https://github.com/shadowsocks/shadowsocks-android/releases" target="_blank">&#x4E0B;&#x8F7D;&#x5730;&#x5740;</a>&#x3002; &#x627E;&#x5230;&#x5E26;&#x6709;<code>Latest release</code>&#x6807;&#x8BC6;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x70B9;&#x51FB; Assets &#x5C55;&#x5F00;&#x53EF;&#x4E0B;&#x8F7D;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x70B9;&#x51FB;&#x4E0B;&#x8F7D; apk &#x6587;&#x4EF6;&#xFF0C;&#x4E0B;&#x8F7D;&#x5B8C;&#x6BD5;&#x540E;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x5B89;&#x88C5; APP&#x3002;&#x6253;&#x5F00; APP&#xFF0C;&#x8F93;&#x5165;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x70B9;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x5706;&#x5F62;&#x56FE;&#x6807;&#x5F00;&#x542F; / &#x5173;&#x95ED;&#x670D;&#x52A1;&#x3002;&#x5F00;&#x542F;&#x65F6;&#x624B;&#x673A;&#x6700;&#x4E0A;&#x65B9;&#x72B6;&#x6001;&#x680F;&#x5E94;&#x8BE5;&#x4F1A;&#x51FA;&#x73B0; vpn &#x7684;&#x5C0F;&#x56FE;&#x6807;&#x3002;</p>
<h2 id="5-&#x5176;&#x4ED6;">5. &#x5176;&#x4ED6;</h2>
<h3 id="51-&#x5173;&#x4E8E;-pac-&#x6A21;&#x5F0F;&#x548C;-global-&#x6A21;&#x5F0F;">5.1 &#x5173;&#x4E8E; PAC &#x6A21;&#x5F0F;&#x548C; Global &#x6A21;&#x5F0F;</h3>
<p>Global &#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x8BBF;&#x95EE;&#x4EFB;&#x4F55;&#x7F51;&#x7AD9;&#x90FD;&#x4F1A;&#x901A;&#x8FC7;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x8BBF;&#x95EE;&#x56FD;&#x5185;&#x7F51;&#x7AD9;&#x65F6;&#x7F51;&#x901F;&#x8FC7;&#x6162;&#x3002; &#x4F7F;&#x7528; PAC &#x6A21;&#x5F0F;&#x65F6;&#xFF0C;Shadowsocks &#x4F1A;&#x8BFB;&#x53D6; PAC &#x6587;&#x4EF6;&#x91CC;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x5224;&#x65AD;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7AD9;&#x662F;&#x5426;&#x88AB;&#x5899;&#xFF0C;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x5C31;&#x901A;&#x8FC7;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x8BBF;&#x95EE;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x88AB;&#x5899;&#xFF0C;&#x4F46;&#x662F;&#x76F4;&#x63A5;&#x5728;&#x5899;&#x5185;&#x8BBF;&#x95EE;&#x65F6;&#x7F51;&#x901F;&#x8D85;&#x6162;&#x3002;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x4EE5;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x914D;&#x7F6E; PAC &#x6587;&#x4EF6;&#x3002; &#x5728;&#x6211;&#x770B;&#x6765;&#x6700;&#x7B80;&#x5355;&#x53EF;&#x884C;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x968F;&#x65F6;&#x5207;&#x6362;&#x6A21;&#x5F0F;&#x6216;&#x5F00;&#x5173;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<h3 id="52-&#x5173;&#x4E8E;-vps-&#x7684;&#x9009;&#x62E9;">5.2 &#x5173;&#x4E8E; VPS &#x7684;&#x9009;&#x62E9;</h3>
<p>&#x4E4B;&#x524D;&#x6211;&#x4E2A;&#x4EBA;&#x4E00;&#x76F4;&#x4F7F;&#x7528; Linode&#xFF0C;&#x7F51;&#x901F;&#x5F88;&#x7A33;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x88AB;&#x5C01;&#x3002;&#x4F46;&#x662F;&#x8FD1;&#x671F;&#x53D1;&#x73B0;&#x5728; Linode &#x7684;&#x767B;&#x5F55;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x8C03;&#x7528;&#x5230; facebook &#x7684;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x4E4B;&#x524D;&#xFF0C;&#x662F;&#x65E0;&#x6CD5;&#x6CE8;&#x518C;&#x6216;&#x767B;&#x5F55; Linode &#x7684;&#xFF0C;&#x4E0D;&#x9002;&#x5B9C;&#x5927;&#x5BB6;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x642D;&#x5EFA;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x60F3;&#x5728; Linode &#x4E0A;&#x642D;&#x5EFA;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;<a href="https://www.linode.com/?r=4ae052ea06605760e53d092ea6cc91c0caf1b214" target="_blank">&#x6CE8;&#x518C;&#x94FE;&#x63A5;</a>&#x3002;</p>
<h2 id="6-&#x5E38;&#x89C1;&#x95EE;&#x9898;&#x53CA;&#x89E3;&#x51B3;&#x65B9;&#x6848;-troubleshooting">6. &#x5E38;&#x89C1;&#x95EE;&#x9898;&#x53CA;&#x89E3;&#x51B3;&#x65B9;&#x6848; Troubleshooting</h2>
<h3 id="61-&#x767B;&#x5F55;-vultr-&#x65F6;&#x7F51;&#x9875;&#x65E0;&#x53CD;&#x5E94;">6.1 &#x767B;&#x5F55; Vultr &#x65F6;&#x7F51;&#x9875;&#x65E0;&#x53CD;&#x5E94;</h3>
<p>&#x6709;&#x65F6;&#x5019;&#x767B;&#x5F55; Vultr &#x4F1A;&#x51FA;&#x73B0;&#x9875;&#x9762;&#x5361;&#x4F4F;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6B64;&#x65F6;&#x76F4;&#x63A5;&#x5237;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x5C31;&#x53EF;&#x6210;&#x529F;&#x767B;&#x5F55;&#x3002;</p>
<h3 id="62-&#x5F00;&#x542F;-shadowsocks-&#x540E;&#x65E0;&#x6CD5;&#x4E0A;&#x7F51;">6.2 &#x5F00;&#x542F; Shadowsocks &#x540E;&#x65E0;&#x6CD5;&#x4E0A;&#x7F51;</h3>
<p>&#x5076;&#x5C14;&#x4F1A;&#x9047;&#x5230;&#x5F00;&#x542F;&#x4E86; shadowsocks &#xFF0C;&#x5374;&#x65E0;&#x6CD5;&#x6253;&#x5F00;&#x4EFB;&#x4F55;&#x7F51;&#x7AD9;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x5899;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x5899;&#x5916;&#x7684;&#x4EE3;&#x7406;&#x4EBA;&#x7ED9;&#x5C01;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x6309;&#x7167;&#x4E0A;&#x6587;&#x4E2D;&#x300C;2.1 &#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x300D;&#x53CA;&#x300C;3. &#x5B89;&#x88C5; Shadowsocks &#x670D;&#x52A1;&#x5668; (&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;)&#x300D;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x5B89;&#x88C5;&#x5899;&#x5916;&#x4EE3;&#x7406;&#x4EBA;&#x5373;&#x53EF;&#x3002;</p>
<hr>
<p>&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x76F4;&#x63A5;&#x8054;&#x7CFB;&#x6211;&#x3002;&#x5982;&#x679C;&#x559C;&#x6B22;&#x672C;&#x6587;&#xFF0C;&#x5C31;&#x8BF7;&#x4F5C;&#x8005;&#x559D;&#x676F;&#x5496;&#x5561;&#x5427;&#x3002;</p>
<blockquote>
<p>Some of us need the occasional coffee to survive.  </p>
</blockquote>
<p><img src="Proxy%20Tutorial%20-%20Vultr/%E6%9C%AA%E7%9F%A5%2013.jpg" alt=""></p>
<blockquote>
<p>&#x53C2;&#x8003;&#x8D44;&#x6599;<br><a href="https://www.linode.com/docs/getting-started/" target="_blank">Getting Started with Linode</a><br><a href="https://www.tipsforchina.com/how-to-setup-a-fast-shadowsocks-server-on-vultr-vps-the-easy-way.html" target="_blank">How to setup a FAST Shadowsocks server (Nov 2019 update)</a><br><a href="https://teddysun.com/" target="_blank">https://teddysun.com</a><br><a href="https://www.zybuluo.com/gongzhen/note/472805" target="_blank">Shadowsocks PAC&#x6A21;&#x5F0F;&#x548C;&#x5168;&#x5C40;&#x6A21;&#x5F0F;&#x7684;&#x533A;&#x522B;</a>  </p>
</blockquote>
<h1 id="gitbookdaretoknow">gitbook/DareToKnow</h1>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Dare To Know">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Proxy Tutorial - Linode.html" class="navigation navigation-next " aria-label="Next page: 吞下这颗红药丸 | 旧版">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"吞下这颗红药丸 | 手把手教你科学上网","level":"1.2.1","depth":2,"next":{"title":"吞下这颗红药丸 | 旧版","level":"1.2.2","depth":2,"path":"daretoknow/Proxy Tutorial - Linode.md","ref":"daretoknow/Proxy Tutorial - Linode.md","articles":[]},"previous":{"title":"Dare To Know","level":"1.2","depth":1,"path":"daretoknow/index.md","ref":"daretoknow/index.md","articles":[{"title":"吞下这颗红药丸 | 手把手教你科学上网","level":"1.2.1","depth":2,"path":"daretoknow/Proxy Tutorial - Vultr.md","ref":"daretoknow/Proxy Tutorial - Vultr.md","articles":[]},{"title":"吞下这颗红药丸 | 旧版","level":"1.2.2","depth":2,"path":"daretoknow/Proxy Tutorial - Linode.md","ref":"daretoknow/Proxy Tutorial - Linode.md","articles":[]},{"title":"小狗钱钱 - 读书笔记","level":"1.2.3","depth":2,"path":"daretoknow/Kira and a Dog Named Money.md","ref":"daretoknow/Kira and a Dog Named Money.md","articles":[]},{"title":"Coming Soon","level":"1.2.4","depth":2,"path":"daretoknow/Coming Soon.md","ref":"daretoknow/Coming Soon.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"daretoknow/Proxy Tutorial - Vultr.md","mtime":"2020-11-21T05:23:32.953Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-21T05:23:33.952Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

