
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>新泽西 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../daretoknow/">
            
                <a href="../daretoknow/">
            
                    
                    Dare To Know
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../daretoknow/Proxy Tutorial - Vultr.html">
            
                <a href="../daretoknow/Proxy Tutorial - Vultr.html">
            
                    
                    吞下这颗红药丸 | 手把手教你科学上网
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../daretoknow/Proxy Tutorial - Linode.html">
            
                <a href="../daretoknow/Proxy Tutorial - Linode.html">
            
                    
                    吞下这颗红药丸 | 旧版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../daretoknow/Coming Soon.html">
            
                <a href="../daretoknow/Coming Soon.html">
            
                    
                    Coming Soon
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    Once Upon a Time
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="New Jersey.html">
            
                <a href="New Jersey.html">
            
                    
                    新泽西
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >新泽西</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="new-jersey">New Jersey</h1>
<h1 id="&#x65B0;&#x6CFD;&#x897F;">&#x65B0;&#x6CFD;&#x897F;</h1>
<p>&#x300C;&#x6211;&#x60F3;&#x597D;&#x6211;&#x8981;&#x5E72;&#x7684;&#x4E86;&#x3002;&#x300D;</p>
<p>&#x6211;&#x4EEC;&#x4E00;&#x684C;&#x4EBA;&#x5403;&#x996D;&#x95F2;&#x804A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7A81;&#x7136;&#x6709;&#x540C;&#x5B66;&#x8FD9;&#x6837;&#x8BF4;&#x9053;&#x3002; </p>
<p>&#x6211;&#x548C; H &#x54E5;&#x540C;&#x65F6;&#x63A5;&#x4E86;&#x8BDD;&#x832C;&#x3002; 
&#x6211;&#x95EE;&#xFF1A;&#x300C;&#x4EC0;&#x4E48;&#x554A;&#xFF1F;&#x300D; 
H &#x54E5;&#x95EE;&#xFF1A;&#x300C;&#x8C01;&#x554A;&#xFF1F;&#x300D; </p>
<p>&#x5728;&#x90A3;&#x4E00;&#x523B;&#x6211;&#x5C31;&#x8BA4;&#x5B9A;&#xFF0C;&#x50CF; H &#x54E5;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x6BD4;&#x6211;&#x66F4;&#x5BB9;&#x6613;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x57FA;&#x56E0;&#x4F20;&#x4E0B;&#x53BB;&#x3002;&#x5982;&#x679C;&#x54EA;&#x5929;&#x5168;&#x4E16;&#x754C;&#x53EA;&#x5269;&#x4E00;&#x4E2A;&#x5B64;&#x5C9B;&#xFF0C;&#x5728;&#x5B64;&#x5C9B;&#x4E0A;&#x653E;&#x4E00;&#x767E;&#x53EA; H &#x54E5;&#xFF0C;&#x4E00;&#x767E;&#x53EA;&#x6211;&#x548C;&#x4E00;&#x767E;&#x4E2A;&#x59D1;&#x5A18;&#x3002;&#x7528;&#x4E0D;&#x4E86;&#x4E24;&#x4EE3;&#xFF0C;&#x6211;&#x5C31;&#x706D;&#x7EDD;&#x4E86;&#x3002; </p>
<p>H &#x54E5;&#x5728;&#x63A5;&#x8BDD;&#x832C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x773C;&#x775B;&#x6CA1;&#x62AC;&#xFF0C;&#x7B77;&#x5B50;&#x6CA1;&#x653E;&#xFF0C;&#x6EE1;&#x5634;&#x56BC;&#x4E86;&#x4E00;&#x534A;&#x7684;&#x706B;&#x7206;&#x8170;&#x82B1;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x4EEC;&#x5403;&#x7684;&#x662F;&#x4E00;&#x5BB6;&#x6E58;&#x83DC;&#x3002;&#x8FD9;&#x79CD;&#x6E58;&#x83DC;&#x9986;&#x5B50;&#xFF0C;&#x5728;&#x7F8E;&#x56FD;&#x53EF;&#x80FD;&#x6709;&#x5341;&#x4E07;&#x5BB6;&#xFF0C;&#x5176;&#x7279;&#x70B9;&#x662F;&#x6BCF;&#x5929;&#x6E05;&#x65E9;&#xFF0C;&#x5E97;&#x4F19;&#x8BA1;&#x628A;&#x5DE8;&#x91CF;&#x7684;&#x7EA2;&#x8FA3;&#x6912;&#x9752;&#x8FA3;&#x6912;&#x5927;&#x849C;&#x5927;&#x8471;&#x751F;&#x59DC;&#x5207;&#x6210;&#x5C0F;&#x5757;&#xFF0C;&#x7EDF;&#x7EDF;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x5927;&#x6876;&#xFF0C;&#x6DF7;&#x5408;&#x5747;&#x5300;&#x3002;&#x7136;&#x540E;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684; 12 &#x5C0F;&#x65F6;&#x91CC;&#xFF0C;&#x4E0D;&#x8BBA;&#x7092;&#x4EC0;&#x4E48;&#x8089;&#x83DC;&#xFF0C;&#x5982;&#x732A;&#x8089;&#x9E21;&#x8089;&#x725B;&#x8089;&#x7F8A;&#x8089;&#x9C7C;&#x8089;&#xFF0C;&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x52A8;&#x7269;&#x5185;&#x810F;&#x5982;&#x5927;&#x80A0;&#x5C0F;&#x80A0;&#x5FC3;&#x809D;&#x80BA;&#x80BE;&#x7B49;&#xFF0C;&#x90FD;&#x5F00;&#x5927;&#x706B;&#xFF0C;&#x5728;&#x9505;&#x91CC;&#x6CFC;&#x4E00;&#x5806;&#x6CB9;&#xFF0C;&#x6293;&#x4E00;&#x5927;&#x628A;&#x6E05;&#x65E9;&#x51C6;&#x5907;&#x597D;&#x7684;&#x914D;&#x6599;&#x6492;&#x5230;&#x6CB9;&#x91CC;&#x7206;&#x9999;&#xFF0C;&#x6700;&#x540E;&#x4E0B;&#x8089;&#x7092;&#x719F;&#x4E86;&#x76DB;&#x76D8;&#x3002;&#x70B9;&#x5341;&#x76D8;&#x8FD9;&#x6837;&#x7684;&#x8089;&#x83DC;&#xFF0C;&#x628A;&#x8089;&#x5403;&#x5149;&#x4E4B;&#x540E;&#x4F1A;&#x5269;&#x4E0B;&#x5341;&#x76D8;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x7684;&#x914D;&#x6599;&#xFF0C;&#x8BA9;&#x4EBA;&#x4EE5;&#x4E3A;&#x662F;&#x70B9;&#x4E86;&#x5341;&#x76D8;&#x540C;&#x6837;&#x7684;&#x83DC;&#x3002; </p>
<p>&#x8FD9;&#x6837;&#x7684;&#x6E58;&#x83DC;&#x9986;&#xFF0C;&#x5982;&#x679C;&#x8FA3;&#x6912;&#x653E;&#x5F97;&#x8DB3;&#x591F;&#x591A;&#xFF0C;&#x5728;&#x7F8E;&#x56FD;&#x5C5E;&#x4E8E;&#x6BD4;&#x8F83;&#x4E0D;&#x9519;&#x7684;&#x4E2D;&#x9910;&#x3002;&#x6B63;&#x5B97;&#x5730;&#x9053;&#x7684;&#x4E2D;&#x9910;&#x5728;&#x7F8E;&#x56FD;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#xFF0C;&#x7F8E;&#x5F0F;&#x4E2D;&#x9910;&#x5012;&#x662F;&#x904D;&#x5730;&#x53EF;&#x89C1;&#xFF0C;&#x5728;&#x7F8E;&#x56FD;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x767E;&#x4E07;&#x5BB6;&#xFF0C;&#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x996D;&#x83DC;&#x901A;&#x5E38;&#x662F;&#x6211;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#x5473;&#x9053;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5458;&#x901A;&#x5E38;&#x64CD;&#x7740;&#x5357;&#x65B9;&#x6216;&#x7CA4;&#x8BED;&#x53E3;&#x97F3;&#x3002;&#x5728;&#x7F8E;&#x56FD;&#x957F;&#x5927;&#x7684;&#x5C0F;&#x5B69;&#x5B50;&#x4EEC;&#xFF0C;&#x5403;&#x4E86;&#x7F8E;&#x5F0F;&#x4E2D;&#x9910;&#xFF0C;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x4E2D;&#x9910;&#x8FD8;&#x4E0D;&#x9519;&#x3002; </p>
<p>&#x5F00;&#x5B66;&#x521D;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x5B66;&#x957F;&#x5B66;&#x59D0;&#x9080;&#x8BF7;&#x6211;&#x4EEC;&#x53BB;&#x6559;&#x4F1A;&#x805A;&#x9910;&#xFF0C;&#x90A3;&#x662F;&#x521A;&#x5230;&#x7F8E;&#x56FD;&#x6CA1;&#x591A;&#x4E45;&#xFF0C;&#x8FD8;&#x6CA1;&#x5F00;&#x59CB;&#x81EA;&#x5DF1;&#x8BA4;&#x771F;&#x505A;&#x996D;&#xFF0C;&#x66F4;&#x6CA1;&#x6478;&#x6E05;&#x9644;&#x8FD1;&#x7F8E;&#x98DF;&#x7684;&#x6240;&#x5728;&#xFF0C;&#x5BF9;&#x4ED8;&#x968F;&#x4FBF;&#x5403;&#x4E86;&#x597D;&#x51E0;&#x5929;&#x4E4B;&#x540E;&#xFF0C;&#x6765;&#x6559;&#x4F1A;&#x5403;&#x4E00;&#x987F;&#x6B63;&#x513F;&#x516B;&#x7ECF;&#x7684;&#x4E2D;&#x9910;&#xFF0C;&#x8033;&#x6839;&#x5B50;&#x591A;&#x5C11;&#x4F1A;&#x8F6F;&#x4E00;&#x70B9;&#x3002;&#x6559;&#x4F1A;&#x7684;&#x996D;&#x83DC;&#x505A;&#x5F97;&#x786E;&#x5B9E;&#x597D;&#x5403;&#xFF0C;&#x5341;&#x6765;&#x9053;&#x83DC;&#x5728;&#x5927;&#x957F;&#x684C;&#x5B50;&#x4E0A;&#x4E00;&#x5B57;&#x6392;&#x5F00;&#xFF0C;&#x81EA;&#x5DF1;&#x7AEF;&#x4E86;&#x76D8;&#x5B50;&#x4ECE;&#x4E00;&#x5934;&#x5403;&#x5230;&#x53E6;&#x4E00;&#x5934;&#xFF0C;&#x518D;&#x5403;&#x56DE;&#x6765;&#xFF0C;&#x4E8E;&#x662F;&#x6B22;&#x559C;&#x3002;&#x53EF;&#x60DC;&#xFF0C;&#x597D;&#x5403;&#x7684;&#x665A;&#x9910;&#x4E0D;&#x662F;&#x514D;&#x8D39;&#x7684;&#xFF0C;&#x5927;&#x5BB6;&#x4EAB;&#x53D7;&#x5B8C;&#x7F8E;&#x98DF;&#xFF0C;&#x8981;&#x4E00;&#x8D77;&#x6B4C;&#x5531;&#x8D5E;&#x9882;&#x67D0;&#x4E9B;&#x6211;&#x8BA4;&#x4E3A;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x6BD4;&#x8F83;&#x7EA0;&#x7ED3;&#x3002;&#x6211;&#x60F3;&#x5982;&#x679C;&#x80FD;&#x53EA;&#x5403;&#x996D;&#x4E0D;&#x5531;&#x6B4C;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x53EF;&#x6BD5;&#x7ADF;&#x8138;&#x76AE;&#x6CA1;&#x90A3;&#x4E48;&#x539A;&#xFF0C;&#x6559;&#x4F1A;&#x7684;&#x996D;&#x5403;&#x4E86;&#x4E24;&#x6B21;&#x540E;&#x6211;&#x5C31;&#x4E0D;&#x518D;&#x7B54;&#x5E94;&#x5B66;&#x59D0;&#x7684;&#x9080;&#x8BF7;&#xFF0C;&#x5B66;&#x59D0;&#x4E5F;&#x77E5;&#x8DA3;&#xFF0C;&#x660E;&#x767D;&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x4E50;&#x610F;&#x88AB;&#x522B;&#x4EBA;&#x62EF;&#x6551;&#x3002;&#x7136;&#x540E;&#x5927;&#x5BB6;&#x5728;&#x65B0;&#x6CFD;&#x897F;&#x76F8;&#x5B89;&#x65E0;&#x4E8B;&#x3002; </p>
<p>&#x5982;&#x679C;&#x6709;&#x4EBA;&#x95EE;&#x6211;&#x5728;&#x54EA;&#x513F;&#x4E0A;&#x5B66;&#xFF0C;&#x6211;&#x4F1A;&#x8BF4;&#x65B0;&#x6CFD;&#x897F;&#x3002;&#x542C;&#x5230;&#x65B0;&#x6CFD;&#x897F;&#x4E09;&#x4E2A;&#x5B57;&#xFF0C;&#x4EBA;&#x4EEC;&#x7684;&#x8868;&#x60C5;&#x901A;&#x5E38;&#x4ECB;&#x4E8E;&#x542C;&#x5230;&#x52A0;&#x5DDE;&#x548C;&#x542C;&#x5230;&#x582A;&#x8428;&#x65AF;&#x5DDE;&#x65F6;&#x7684;&#x8868;&#x60C5;&#x4E4B;&#x95F4;&#xFF0C;&#x4ECB;&#x4E8E;&#x542C;&#x5230;&#x5FB7;&#x5DDE;&#x548C;&#x7530;&#x7EB3;&#x897F;&#x5DDE;&#x65F6;&#x7684;&#x8868;&#x60C5;&#x4E4B;&#x95F4;&#x3002; </p>
<p>&#x5728;&#x6211;&#x6765;&#x65B0;&#x6CFD;&#x897F;&#x4E4B;&#x524D;&#xFF0C;&#x5E76;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x65B0;&#x6CFD;&#x897F;&#x5728;&#x54EA;&#x91CC;&#x3002;&#x6211;&#x9009;&#x5B66;&#x6821;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x89C9;&#x5F97;&#x5E94;&#x8BE5;&#x53BB;&#x53D1;&#x8FBE;&#x5730;&#x533A;&#xFF0C;&#x4E1C;&#x90E8;&#x6CBF;&#x6D77;&#x5730;&#x533A;&#xFF0C;&#x90A3;&#x91CC;&#x5E94;&#x8BE5;&#x53D1;&#x8FBE;&#xFF0C;&#x6211;&#x5C31;&#x8981;&#x53BB;&#x90A3;&#x91CC;&#x3002;&#x521A;&#x5230;&#x65B0;&#x6CFD;&#x897F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B66;&#x957F;&#x4ECE;&#x673A;&#x573A;&#x63A5;&#x6211;&#x4EEC;&#x5230;&#x5B66;&#x6821;&#xFF0C;&#x653E;&#x4E0B;&#x884C;&#x674E;&#x7D27;&#x63A5;&#x7740;&#x5C31;&#x5F00;&#x8F66;20&#x5206;&#x949F;&#x5E26;&#x6211;&#x4EEC;&#x53BB;&#x5403;&#x4E86;&#x987F; Buffalo Wild Wings &#x70E4;&#x9E21;&#x7FC5;&#xFF0C;&#x9E21;&#x7FC5;&#x6D82;&#x4E86;&#x9171;&#x6599;&#x4E00;&#x70E4;&#xFF0C;&#x4E00;&#x80A1;&#x9178;&#x8FA3;&#x5473;&#x3002;&#x62FF;&#x62C7;&#x6307;&#x7C97;&#x7684;&#x82B9;&#x83DC;&#x6746;&#x8638;&#x4E86;&#x4E73;&#x767D;&#x8272;&#x7684;&#x9171;&#x653E;&#x5728;&#x5634;&#x91CC;&#x4E00;&#x901A;&#x56BC;&#x3002;&#x5403;&#x9971;&#x4E86;&#x9E21;&#x7FC5;&#xFF0C;&#x5B66;&#x957F;&#x5728;&#x8F66;&#x91CC;&#x8DDF;&#x6211;&#x4EEC;&#x804A;&#x4E70;&#x8F66;&#x7684;&#x4E8B;&#x513F;&#xFF0C;&#x4E70;&#x54EA;&#x5E74;&#x7684;&#x8F66;&#xFF0C;&#x4EC0;&#x4E48;&#x4EF7;&#x4F4D;&#x4EE5;&#x53CA;&#x65E5;&#x672C;&#x8F66;&#x7684;&#x79CD;&#x79CD;&#x597D;&#x5904;&#x3002;&#x65E5;&#x672C;&#x8F66;&#x597D;&#x5904;&#x5DE8;&#x5927;&#xFF0C;&#x4E0D;&#x6613;&#x51FA;&#x6545;&#x969C;&#xFF0C;&#x597D;&#x4FEE;&#xFF0C;&#x4FDD;&#x503C;&#xFF0C;&#x7701;&#x6CB9;&#xFF0C;&#x4FBF;&#x5B9C;&#x3002;&#x51E0;&#x4E2A;&#x6708;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5BBF;&#x820D;&#x56DB;&#x4E2A;&#x4EBA;&#x90FD;&#x4E70;&#x8F66;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x8F86;&#x662F;&#x65E5;&#x672C;&#x8F66;&#x3002; </p>
<p>&#x4E2D;&#x56FD;&#x7559;&#x5B66;&#x751F;&#x91CC;&#x571F;&#x8C6A;&#x5F88;&#x591A;&#x3002;&#x9AD8;&#x6863;&#x6C7D;&#x8F66;&#x5728;&#x8FDB;&#x5165;&#x4E2D;&#x56FD;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x6536;&#x53D6;&#x4E86;&#x767E;&#x5206;&#x4E4B;&#x4E00;&#x767E;&#x7684;&#x5173;&#x7A0E;&#xFF0C;&#x571F;&#x8C6A;&#x4EEC;&#x770B;&#x5230;&#x8C6A;&#x8F66;&#x5728;&#x7F8E;&#x56FD;&#x7684;&#x4EF7;&#x683C;&#x53EA;&#x6709;&#x56FD;&#x5185;&#x4EF7;&#x683C;&#x7684;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x751A;&#x81F3;&#x56DB;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x57FA;&#x672C;&#x7EA2;&#x4E86;&#x773C;&#x3002;&#x4E70;&#x6765;&#x62E5;&#x6709; 6 &#x5230; 8 &#x7F38;&#x53D1;&#x52A8;&#x673A;&#xFF0C;3.0 &#x4EE5;&#x4E0A;&#x5927;&#x6392;&#x91CF;&#xFF0C;&#x8F66;&#x6807;&#x8000;&#x773C;&#x5916;&#x5F62;&#x98CE;&#x9A9A;&#x7684;&#x91CE;&#x517D;&#xFF0C;&#x9A70;&#x9A8B;&#x5728;&#x7F8E;&#x56FD;&#x4E00;&#x671B;&#x65E0;&#x9645;&#x7684;&#x4E61;&#x6751;&#x5C0F;&#x8DEF;&#x4E0A;&#xFF0C;&#x975E;&#x5E38;&#x795E;&#x6C14;&#x3002;H &#x54E5;&#x8BF4;&#xFF0C;&#x5927;&#x8F66;&#x901A;&#x5E38;&#x662F;&#x5C0F;&#x9E21;&#x9E21;&#x7537;&#x4EBA;&#x5F00;&#x7684;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5F88;&#x6709;&#x9053;&#x7406;&#x3002;&#x7B49;&#x6211;&#x6709;&#x4E86;&#x94B1;&#xFF0C;&#x6211;&#x4E5F;&#x4E70;&#x4E00;&#x8F86;&#x8C6A;&#x8F66;&#xFF0C;&#x8F66;&#x5185;&#x7A7A;&#x95F4;&#x5DE8;&#x5927;&#xFF0C;&#x8F7B;&#x677E;&#x88C5;&#x4E0B;&#x6211;&#x6D51;&#x8EAB;&#x7684;&#x5112;&#x5F31;&#x3002;&#x4E00;&#x811A;&#x6CB9;&#x95E8;&#xFF0C;&#x53D1;&#x52A8;&#x673A;&#x8F70;&#x9E23;&#x9707;&#x8033;&#x6B32;&#x804B;&#xFF0C;&#x575A;&#x5B9E;&#x5730;&#x63A9;&#x76D6;&#x6211;&#x5185;&#x5FC3;&#x7684;&#x4E0D;&#x5B89;&#x3002; </p>
<p>H &#x54E5;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x575A;&#x633A;&#x3002;&#x4E0D;&#x662F;&#x8BF4;&#x4E0B;&#x9762;&#x633A;&#xFF0C;&#x800C;&#x662F;&#x5185;&#x5FC3;&#x91CC;&#x603B;&#x6709;&#x4E00;&#x4E2A;&#x68CD;&#x72B6;&#x7269;&#xFF0C;&#x6C38;&#x8FDC;&#x96C4;&#x8D73;&#x8D73;&#x7684;&#xFF0C;&#x4ECE;&#x4E0D;&#x75B2;&#x8F6F;&#x3002;&#x8DDF; H &#x54E5;&#x4E00;&#x5757;&#x513F;&#x53BB;&#x6E38;&#x6CF3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x611F;&#x53D7;&#x5C24;&#x4E3A;&#x6DF1;&#x5207;&#x3002;&#x603B;&#x6709;&#x8000;&#x773C;&#x7684;&#x5149;&#x4ECE; H &#x54E5;&#x7684;&#x80F8;&#x8154;&#x91CC;&#x900F;&#x51FA;&#x6765;&#xFF0C;&#x7167;&#x4EAE;&#x6574;&#x4E2A;&#x6CF3;&#x6C60;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x6234;&#x4E0A;&#x80FD;&#x4E70;&#x5230;&#x7684;&#x989C;&#x8272;&#x6700;&#x6DF1;&#x7684;&#x6CF3;&#x955C;&#xFF0C;&#x5426;&#x5219;&#x4E0B;&#x4E86;&#x6C34;&#x6839;&#x672C;&#x7741;&#x4E0D;&#x5F00;&#x773C;&#x3002; </p>
<p>&#x5728;&#x6211;&#x4E70;&#x4E86;&#x8F66;&#x4E4B;&#x540E;&#xFF0C;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x7684;11&#x70B9;&#x534A;&#x5C31;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5C34;&#x5C2C;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;Popeyes &#x70B8;&#x9E21;&#x5E97;&#x518D;&#x6709;&#x534A;&#x5C0F;&#x65F6;&#x5C31;&#x8981;&#x5173;&#x95E8;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x5982;&#x679C;&#x6284;&#x8D77;&#x8F66;&#x94A5;&#x5319;&#x51B2;&#x51FA;&#x5BB6;&#x95E8;&#xFF0C;&#x5C31;&#x80FD;&#x5728; Popeyes &#x5173;&#x95E8;&#x4E4B;&#x524D;&#x8D76;&#x5230;&#xFF0C;&#x4EE5;&#x6781;&#x4F4E;&#x7684;&#x4EF7;&#x683C;&#x4E70;&#x5230;&#x4E00;&#x5927;&#x76D2;&#x6CB9;&#x817B;&#x7684;&#x70B8;&#x9E21;&#xFF0C;&#x8574;&#x542B;&#x5927;&#x91CF;&#x86CB;&#x767D;&#x8D28;&#x548C;&#x8102;&#x80AA;&#x3002;&#x7ECF;&#x8FC7;&#x4E00;&#x5929;&#x7684;&#x610F;&#x6DEB;&#xFF0C;&#x6211;&#x7684;&#x5927;&#x8111;&#x6D88;&#x8017;&#x6389;&#x4E86;&#x4E00;&#x4E07;&#x5927;&#x5361;&#x7684;&#x70ED;&#x91CF;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x5EC9;&#x4EF7;&#x7684;&#x80FD;&#x91CF;&#x3002;&#x9971;&#x9910;&#x540E;&#x6162;&#x6162;&#x5F00;&#x8F66;&#x56DE;&#x5BB6;&#xFF0C;&#x8F66;&#x91CC;&#x5FC5;&#x987B;&#x653E;&#x7740;&#x97F3;&#x4E50;&#x3002;&#x5230;&#x5BB6;&#x505C;&#x8F66;&#x5165;&#x5E93;&#xFF0C;&#x5173;&#x706F;&#x7184;&#x706B;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x4E0D;&#x62D4;&#x51FA;&#x8F66;&#x94A5;&#x5319;&#xFF0C;&#x97F3;&#x4E50;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x7F13;&#x7F13;&#x5730;&#x653E;&#x7740;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x523B;&#x975E;&#x5E38;&#x5371;&#x9669;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x523B;&#x611F;&#x53D7;&#x5230;&#x88AB;&#x6DF1;&#x5EA6;&#x6BC1;&#x706D;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x6211;&#x6015;&#x8FD9;&#x6837;&#x7684;&#x591C;&#x665A;&#x591A;&#x4E86;&#xFF0C;&#x7A81;&#x7136;&#x67D0;&#x5929;&#x5230;&#x5BB6;&#xFF0C;&#x505C;&#x8F66;&#x5165;&#x5E93;&#xFF0C;&#x5173;&#x706F;&#x7184;&#x706B;&#x540E;&#xFF0C;&#x4E0D;&#x518D;&#x60F3;&#x5B89;&#x9759;&#x542C;&#x5B8C;&#x51E0;&#x53EA;&#x66F2;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x7ACB;&#x523B;&#x62D4;&#x4E86;&#x8F66;&#x94A5;&#x5319;&#x3002;&#x6015;&#x8FD9;&#x6837;&#x7684;&#x591C;&#x665A;&#x591A;&#x4E86;&#xFF0C;&#x5BF9;&#x5F85;&#x4E16;&#x754C;&#x4E0D;&#x518D;&#x50CF;&#x4ECE;&#x524D;&#x90A3;&#x6837;&#x6E29;&#x67D4;&#xFF0C;&#x5F00;&#x59CB;&#x5BB3;&#x6015;&#x8F93;&#x8D62;&#xFF0C;&#x4E0D;&#x518D;&#x8F7B;&#x6613;&#x8BA4;&#x771F;&#x3002;&#x809A;&#x5B50;&#x4E0A;&#x7684;&#x80A5;&#x8089;&#x4E00;&#x5C42;&#x5C42;&#x957F;&#x51FA;&#x6765;&#xFF0C;&#x4F4E;&#x4E0B;&#x5934;&#x9664;&#x4E86;&#x8089;&#x4EC0;&#x4E48;&#x4E5F;&#x770B;&#x4E0D;&#x89C1;&#xFF0C;&#x7167;&#x955C;&#x5B50;&#x53D1;&#x73B0;&#x5B83;&#x987A;&#x4ECE;&#x5730;&#x8EB2;&#x5728;&#x80A5;&#x8089;&#x540E;&#x9762;&#xFF0C;&#x4E0D;&#x518D;&#x56A3;&#x5F20;&#x3002;&#x7A81;&#x7136;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x5185;&#x5FC3;&#x4E0D;&#x518D;&#x80BF;&#x80C0;&#xFF0C;&#x6E05;&#x6668;&#x8D77;&#x6765;&#x56DE;&#x5FC6;&#x6628;&#x591C;&#x7684;&#x68A6;&#xFF0C;&#x4E0D;&#x518D;&#x8138;&#x7EA2;&#x5FC3;&#x8DF3;&#x3002;&#x4E0D;&#x518D;&#x5929;&#x9A6C;&#x884C;&#x7A7A;&#xFF0C;&#x4E0D;&#x518D;&#x70ED;&#x6CEA;&#x76C8;&#x7736;&#x3002; </p>
<p>&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x95E8;&#x8BFE;&#xFF0C;&#x5B66;&#x4E60;&#x4E00;&#x79CD;&#x53E4;&#x8001;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x4EFB;&#x8BFE;&#x8001;&#x5E08;&#x76F8;&#x4FE1;&#x4E00;&#x79CD;&#x56FD;&#x5185;&#x975E;&#x5E38;&#x8457;&#x540D;&#x7684;&#x67D0;&#x67D0;&#x529F;&#xFF0C;&#x5728;&#x4ED6;&#x90A3;&#x95E8;&#x8BFE;&#x7684;&#x7F51;&#x9875;&#x6700;&#x4E0B;&#x65B9;&#xFF0C;&#x6709;&#x67D0;&#x67D0;&#x529F;&#x7F51;&#x7AD9;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x70B9;&#x8FDB;&#x53BB;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x5947;&#x5947;&#x602A;&#x602A;&#x7684;&#x4E1C;&#x897F;&#x8E66;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x4F4D;&#x529F;&#x8001;&#x5E08;&#x770B;&#x8D77;&#x6765;&#x662F;&#x534E;&#x88D4;&#xFF0C;&#x82F1;&#x6587;&#x8BF4;&#x7684;&#x4E0D;&#x591F;&#x5229;&#x7D22;&#xFF0C;&#x8BB2;&#x8BFE;&#x6C34;&#x5E73;&#x53C8;&#x5F88;&#x7CDF;&#x7CD5;&#xFF0C;&#x4E24;&#x5802;&#x8BFE;&#x4E0B;&#x6765;&#xFF0C;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x5C31;&#x4E0D;&#x518D;&#x60F3;&#x53BB;&#x542C;&#x8BFE;&#xFF0C;&#x5076;&#x5C14;&#x53BB;&#x4E00;&#x6B21;&#xFF0C;&#x80FD;&#x770B;&#x89C1;&#x56FD;&#x5916;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x95EE;&#x4E00;&#x4E9B;&#x5F88;&#x6D45;&#x663E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x529F;&#x8001;&#x5E08;&#x7528;&#x82F1;&#x6587;&#x8D39;&#x529B;&#x5730;&#x89E3;&#x91CA;&#xFF0C;&#x7565;&#x663E;&#x7A98;&#x8FEB;&#x3002; </p>
<p>&#x6BCF;&#x5230;&#x671F;&#x672B;&#xFF0C;&#x603B;&#x6709;&#x540C;&#x5B66;&#x80FD;&#x591F;&#x795E;&#x5947;&#x822C;&#x5730;&#x641E;&#x5230;&#x5F80;&#x5C4A;&#x7684;&#x8003;&#x8BD5;&#x9898;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x6280;&#x80FD;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x4E14;&#x53EF;&#x6015;&#x3002;&#x8BD5;&#x9898;&#x5230;&#x624B;&#x540E;&#xFF0C;&#x540C;&#x5B66;&#x4EEC;&#x5C0F;&#x8303;&#x56F4;&#x4F20;&#x9605;&#x4E00;&#x4E0B;&#xFF0C;&#x5FC3;&#x91CC;&#x5C31;&#x6709;&#x4E86;&#x5E95;&#x3002;&#x5F53;&#x65F6;&#x529F;&#x8001;&#x5E08;&#x90A3;&#x95E8;&#x8BFE;&#x7684;&#x8003;&#x8BD5;&#xFF0C;&#x6211;&#x62FF;&#x5230;&#x5377;&#x5B50;&#x4E00;&#x7FFB;&#xFF0C;&#x53D1;&#x73B0;&#x8DDF;&#x540C;&#x5B66;&#x627E;&#x6765;&#x7684;&#x53BB;&#x5E74;&#x8003;&#x9898;&#x57FA;&#x672C;&#x4E00;&#x6837;&#xFF0C;&#x5C31;&#x8FC5;&#x901F;&#x628A;&#x5377;&#x5B50;&#x7B54;&#x5B8C;&#xFF0C;&#x73AF;&#x89C6;&#x6559;&#x5BA4;&#x4E00;&#x5468;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x8FD8;&#x5728;&#x95F7;&#x5934;&#x5199;&#xFF0C;&#x6CA1;&#x6709;&#x60F3;&#x4EA4;&#x5377;&#x7684;&#x610F;&#x601D;&#x3002;&#x6211;&#x611F;&#x89C9;&#x5230;&#x5468;&#x56F4;&#x4E0D;&#x65AD;&#x6709;&#x567C;&#x556A;&#x7206;&#x88C2;&#x800C;&#x6B7B;&#x7684;&#x8111;&#x7EC6;&#x80DE;&#xFF0C;&#x4ECE;&#x5927;&#x5BB6;&#x8111;&#x888B;&#x9876;&#x4E0A;&#x5347;&#x8D77;&#x4E00;&#x56E2;&#x56E2;&#x623E;&#x6C14;&#xFF0C;&#x5F25;&#x6F2B;&#x5728;&#x6559;&#x5BA4;&#x5468;&#x56F4;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x5730;&#x65B9;&#x6CA1;&#x6CD5;&#x5F85;&#x4E86;&#x3002;&#x6211;&#x4EA4;&#x4E86;&#x5377;&#xFF0C;&#x65C1;&#x8FB9;&#x5395;&#x6240;&#x6492;&#x4E86;&#x6CE1;&#x5C3F;&#xFF0C;&#x8F6C;&#x8EAB;&#x79BB;&#x5F00;&#x3002;&#x53EF;&#x6211;&#x521A;&#x8D70;&#x51FA;&#x6559;&#x5B66;&#x697C;&#xFF0C;&#x529F;&#x8001;&#x5E08;&#x7ADF;&#x62FF;&#x7740;&#x6211;&#x7684;&#x5377;&#x5B50;&#x8FFD;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x8BA9;&#x6211;&#x6539;&#x6539;&#x6700;&#x540E;&#x4E00;&#x9053;&#x9898;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x770B;&#x4E86;&#x4E24;&#x904D;&#xFF0C;&#x4E5F;&#x6CA1;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x9519;&#x5728;&#x54EA;&#x513F;&#x4E86;&#xFF0C;&#x5C31;&#x53EA;&#x5B57;&#x672A;&#x6539;&#x628A;&#x5377;&#x5B50;&#x53C8;&#x4EA4;&#x56DE;&#x53BB;&#x4E86;&#x3002;&#x8D70;&#x5728;&#x56DE;&#x5BBF;&#x820D;&#x7684;&#x8DEF;&#x4E0A;&#x88AB;&#x592A;&#x9633;&#x6652;&#x4E86;&#x4E00;&#x6652;&#xFF0C;&#x624D;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#x662F;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x7528;&#x9519;&#x4E86;&#xFF0C;&#x4E0D;&#x7981;&#x82E6;&#x7B11;&#x81EA;&#x5DF1;&#x8FD8;&#x662F;&#x592A;&#x5E74;&#x8F7B;&#x3002;&#x8BA9;&#x6211;&#x9707;&#x60CA;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x542C;&#x4ED6;&#x7684;&#x8BFE;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x7EC3;&#x4ED6;&#x7684;&#x529F;&#xFF0C;&#x4ED6;&#x8FD8;&#x975E;&#x8FFD;&#x51FA;&#x6765;&#x8BA9;&#x6211;&#x6539;&#x6700;&#x540E;&#x4E00;&#x9053;&#x9898;&#xFF0C;&#x51B3;&#x4E0D;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x95F2;&#x7684;&#x86CB;&#x75BC;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x4ED6;&#x8111;&#x5B50;&#x91CC;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x4E48;&#x60F3;&#x7684;&#xFF1A;&#x8FD9;&#x4E2A;&#x5C11;&#x5E74;&#xFF0C;&#x4ED6;&#x867D;&#x7136;&#x6CA1;&#x542C;&#x6211;&#x7684;&#x8BFE;&#xFF0C;&#x4ED6;&#x867D;&#x7136;&#x6CA1;&#x7EC3;&#x6211;&#x7684;&#x529F;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x4EC5;&#x51ED;&#x8FD9;&#x4E24;&#x70B9;&#xFF0C;&#x5C31;&#x8BA9;&#x4ED6;&#x5931;&#x53BB;&#x4E00;&#x6B21;&#x8D85;&#x5EA6;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x8BC4;&#x4EF7;&#x522B;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x8BB0;&#x4F4F;&#x5E76;&#x975E;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x8FD9;&#x6837;&#x4F18;&#x8D8A;&#x7684;&#x6761;&#x4EF6;&#x3002; </p>
<p>&#x5728;&#x7F13;&#x6162;&#x7684;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x8FC7;&#x65E0;&#x6570;&#x7C98;&#x7A20;&#x7684;&#x590F;&#x5929;&#x7684;&#x5348;&#x540E;&#xFF0C;&#x6216;&#x662F;&#x4E00;&#x4E9B;&#x5929;&#x9AD8;&#x4E91;&#x6DE1;&#x7684;&#x79CB;&#x5929;&#xFF0C;&#x5C11;&#x5E74;&#x8EAB;&#x8FB9;&#x6240;&#x6709;&#x539F;&#x5B50;&#x594B;&#x529B;&#x9707;&#x52A8;&#xFF0C;&#x8BD5;&#x56FE;&#x544A;&#x77E5;&#x4ED6;&#x4E00;&#x4E9B;&#x9053;&#x7406;&#xFF0C;&#x4F46;&#x603B;&#x4E0D;&#x6E05;&#x6670;&#x3002;&#x5728;&#x51A5;&#x51A5;&#x4E2D;&#x611F;&#x77E5;&#x5230;&#x7684;&#x529B;&#x91CF;&#x56E0;&#x5F62;&#x6001;&#x7684;&#x4E0D;&#x660E;&#x786E;&#x800C;&#x65E0;&#x6CD5;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#xFF0C;&#x6240;&#x4EE5;&#x81EA;&#x4EE5;&#x4E3A;&#x662F;&#x5730;&#x6325;&#x6325;&#x624B;&#xFF0C;&#x628A;&#x9762;&#x524D;&#x7684;&#x7A7A;&#x6C14;&#x8D76;&#x5230;&#x4E00;&#x65C1;&#x3002; </p>
<p>&#x5728;&#x4EFB;&#x4F55;&#x56E0;&#x4E3A;&#x81EA;&#x8EAB;&#x6761;&#x4EF6;&#x4F18;&#x8D8A;&#x800C;&#x6CBE;&#x6CBE;&#x81EA;&#x559C;&#x7684;&#x65F6;&#x523B;&#xFF0C;&#x8EAB;&#x5B50;&#x603B;&#x5BB9;&#x6613;&#x53D8;&#x8F7B;&#x98D8;&#x5230;&#x534A;&#x7A7A;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5236;&#x5B9A;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x5212;&#x5B9A;&#x4E00;&#x4E9B;&#x754C;&#x9650;&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x52A0;&#x5C45;&#x9AD8;&#x4E34;&#x4E0B;&#x3002;&#x6211;&#x8DDF;H&#x54E5;&#x8BF4;&#xFF0C;&#x54EA;&#x5929;&#x6211;&#x98D8;&#x4E86;&#xFF0C;&#x4F60;&#x4E2B;&#x62FD;&#x6211;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x8DDF;&#x4F60;&#x53BB;&#x627E;&#x771F;&#x7684;&#x592A;&#x9633;&#x771F;&#x7684;&#x6CC9;&#x6C34;&#x3002;H&#x54E5;&#x7AD9;&#x5728;&#x5730;&#x4E0A;&#xFF0C;&#x770B;&#x89C1;&#x534A;&#x7A7A;&#x4E2D;&#x98D8;&#x7740;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x597D;&#x50CF;&#x653E;&#x98DE;&#x4E86;&#x4E00;&#x5806;&#x6C14;&#x7403;&#x3002; </p>
<p>&#x7EBD;&#x7EA6;&#x5317;&#x8FB9;&#x6709;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x53EB; Woodbury&#xFF0C;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x4EE5;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x5965;&#x7279;&#x83B1;&#x65AF;&#x800C;&#x95FB;&#x540D;&#xFF0C;&#x6BCF;&#x5E74;&#x611F;&#x6069;&#x8282;&#x7684;&#x9ED1;&#x8272;&#x661F;&#x671F;&#x4E94;&#xFF0C;&#x8FD9;&#x91CC;&#x901A;&#x5BB5;&#x8425;&#x4E1A;&#xFF0C;&#x6EE1;&#x8DB3;&#x6D88;&#x8D39;&#x8005;&#x96C6;&#x4E2D;&#x7206;&#x53D1;&#x7684;&#x75AF;&#x72C2;&#x6B32;&#x671B;&#x3002;&#x5F7B;&#x591C;&#x901A;&#x660E;&#x7684;&#x706F;&#x706B;&#x7167;&#x4EAE;&#x7EBD;&#x7EA6;&#x5317;&#x65B9;&#x7684;&#x4E00;&#x7247;&#x5C71;&#x533A;&#xFF0C;&#x548C;&#x5341;&#x4E07;&#x5F20;&#x5174;&#x594B;&#x7684;&#x9762;&#x5B54;&#x3002;&#x6574;&#x4E2A;&#x5965;&#x7279;&#x83B1;&#x65AF;&#x5C0F;&#x9547;&#x4E0A;&#x4EBA;&#x5934;&#x6512;&#x52A8;&#xFF0C;&#x5076;&#x6709;&#x51DB;&#x51BD;&#x5BD2;&#x98CE;&#xFF0C;&#x4EBA;&#x4EEC;&#x6B65;&#x5C65;&#x8F7B;&#x76C8;&#x6025;&#x4FC3;&#xFF0C;&#x53CC;&#x624B;&#x62CE;&#x6EE1;&#x8D2D;&#x7269;&#x888B;&#xFF0C;&#x888B;&#x5B50;&#x4E0A;&#x7684; logo &#x6324;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4E71;&#x82B1;&#x6E10;&#x6B32;&#x8FF7;&#x4EBA;&#x773C;&#x3002;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x5360;&#x522B;&#x4EBA;&#x4FBF;&#x5B9C;&#xFF08;&#x5E76;&#x4E14;&#x5E2E;&#x522B;&#x4EBA;&#x6570;&#x94B1;&#xFF09;&#x66F4;&#x8BA9;&#x4EBA;&#x6697;&#x723D;&#x7684;&#x4E86;&#x3002; </p>
<p>&#x5F53;&#x5929;&#xFF0C;&#x6211;&#x4EEC;&#x5BBF;&#x820D;&#x503E;&#x5DE2;&#x800C;&#x51FA;&#x3002;&#x7B49;&#x5230;&#x6EE1;&#x8F7D;&#x800C;&#x5F52;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5929;&#x521A;&#x597D;&#x8499;&#x8499;&#x4EAE;&#xFF0C;&#x9884;&#x793A;&#x65B0;&#x751F;&#x6D3B;&#x7684;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x6218;&#x5229;&#x54C1;&#x5806;&#x6EE1;&#x5BA2;&#x5385;&#xFF0C;&#x8BA8;&#x8BBA;&#x90FD;&#x4E70;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x542C;&#x5230;&#x5927;&#x5BB6;&#x8C08;&#x8BBA;&#x5F88;&#x591A;&#x6211;&#x6CA1;&#x542C;&#x8BF4;&#x8FC7;&#x7684;&#x724C;&#x5B50;&#xFF0C;&#x53EF;&#x8FD9;&#x7C7B;&#x8C08;&#x8BDD;&#xFF0C;&#x603B;&#x9700;&#x8981;&#x53C2;&#x4E0E;&#x8005;&#x6709;&#x76F8;&#x5F53;&#x7684;&#x80CC;&#x666F;&#x77E5;&#x8BC6;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4E0D;&#x65B9;&#x4FBF;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x9759;&#x9759;&#x7684;&#x5750;&#x5728;&#x4E00;&#x8FB9;&#xFF0C;&#x4E13;&#x5FC3;&#x542C;&#x5927;&#x5BB6;&#x6559;&#x6211;&#x505A;&#x4EBA;&#x3002; </p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x5B66;&#x505A;&#x4EBA;&#x7684;&#x673A;&#x4F1A;&#x7B80;&#x76F4;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x8BB0;&#x5F97;&#x4E0A;&#x521D;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#x8BFE;&#x95F4;&#x4F11;&#x606F;&#xFF0C;&#x73ED;&#x91CC;&#x6CA1;&#x51E0;&#x4E2A;&#x4EBA;&#xFF0C;&#x6211;&#x5750;&#x5728;&#x4F4D;&#x5B50;&#x4E0A;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x5E72;&#x561B;&#xFF0C;&#x65C1;&#x8FB9;&#x4E24;&#x4E2A;&#x5973;&#x751F;&#x5728;&#x8C08;&#x8BBA;&#x54C8;&#x6839;&#x8FBE;&#x65AF;&#x7684;&#x51B0;&#x6DC7;&#x6DCB;&#x706B;&#x9505;&#x3002;&#x5F53;&#x65F6;&#x7684;&#x6211;&#x7AD9;&#x8D77;&#x6765;&#x8EAB;&#x9AD8;&#x4E0D;&#x8DB3;160&#xFF0C;&#x6234;&#x4E2A;&#x5C0F;&#x773C;&#x955C;&#xFF0C;&#x5FC3;&#x4E2D;&#x6CA1;&#x6709;&#x5BB6;&#x56FD;&#x5929;&#x4E0B;&#xFF0C;&#x53EA;&#x987E;&#x81EA;&#x5DF1;&#x7684;&#x9762;&#x5B50;&#xFF0C;&#x66F4;&#x4F55;&#x51B5;&#x5F53;&#x65F6;&#x8BB2;&#x8BDD;&#x7684;&#x662F;&#x73ED;&#x4E0A;&#x5F88;&#x6F02;&#x4EAE;&#x7684;&#x4E24;&#x4E2A;&#x5973;&#x751F;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x54C8;&#x6839;&#x8FBE;&#x65AF;&#xFF0C;&#x51B0;&#x6DC7;&#x6DCB;&#xFF0C;&#x706B;&#x9505;&#x8FD9;&#x4E09;&#x4E2A;&#x8BCD;&#x540C;&#x65F6;&#x4F20;&#x8FDB;&#x8033;&#x6735;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5FC3;&#x4E2D;&#x4E00;&#x7D27;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x542C;&#x5230;&#x90A3;&#x4E09;&#x4E2A;&#x8BCD;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x968F;&#x5373;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF1A;&#x5979;&#x4EEC;&#x5728;&#x8C08;&#x8BBA;&#x4E00;&#x4E2A;&#x5F88;&#x725B;&#x903C;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x800C;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E8B;&#x7269;&#x7684;&#x4E86;&#x89E3;&#x7A0B;&#x5EA6;&#x80FD;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x9636;&#x7EA7;&#x3002;&#x6211;&#x8EAB;&#x4F53;&#x4E00;&#x52A8;&#x4E0D;&#x52A8;&#xFF0C;&#x5C0F;&#x8111;&#x888B;&#x98DE;&#x901F;&#x8FD0;&#x8F6C;&#xFF0C;&#x601D;&#x7D22;&#x4EE5;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x59FF;&#x6001;&#x624D;&#x80FD;&#x4E0D;&#x66B4;&#x9732;&#x6211;&#x7684;&#x4EBA;&#x751F;&#x4E0E;&#x90A3;&#x4E2A;&#x725B;&#x903C;&#x4E8B;&#x7269;&#x6BEB;&#x65E0;&#x4EA4;&#x96C6;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#xFF0C;&#x4EE5;&#x53CA;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x53EF;&#x4EE5;&#x540C;&#x5979;&#x4EEC;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E00;&#x8BDD;&#x9898;&#xFF0C;&#x80FD;&#x591F;&#x5728;&#x591A;&#x957F;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x83B7;&#x5F97;&#x5979;&#x4EEC;&#x7684;&#x76EE;&#x5149;&#x3002; </p>
<p>&#x8FD9;&#x4E9B;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x5B66;&#x505A;&#x4EBA;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x8DDF;&#x522B;&#x4EBA;&#x7684;&#x7236;&#x6BCD;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x505A;&#x4EBA;&#x3002;&#x7FA1;&#x6155;&#x522B;&#x4EBA;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x52AA;&#x529B;&#x594B;&#x6597;&#x4E89;&#x53D6;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x5B69;&#x5B50;&#x5C31;&#x80FD;&#x8033;&#x6FE1;&#x76EE;&#x67D3;&#x3002;&#x957F;&#x5927;&#x540E;&#x6211;&#x7684;&#x5B69;&#x5B50;&#x5C31;&#x6210;&#x4E86;&#x4F60;&#xFF0C;&#x53EA;&#x662F;&#x9694;&#x4E86;&#x4E00;&#x4EE3;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x3002;&#x771F;&#x6B63;&#x53EF;&#x8D35;&#x7684;&#xFF0C;&#x662F;&#x90A3;&#x4E9B;&#x9694;&#x4EE3;&#x4E5F;&#x5B66;&#x4E0D;&#x6765;&#x7684;&#x54C1;&#x8D28;&#xFF0C;&#x6BD4;&#x5982;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#xFF1A;&#x4EF0;&#x671B;&#x661F;&#x7A7A;&#xFF0C;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x7684;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x3002; </p>
<p>&#x6211;&#x7684;&#x5973;&#x670B;&#x53CB;&#x5C31;&#x975E;&#x5E38;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x6E29;&#x54E5;&#x534E;&#x73A9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6B63;&#x597D;&#x8D76;&#x4E0A;&#x5723;&#x8BDE;&#x8282;&#xFF0C;&#x5728;&#x6211;&#x8003;&#x8651;&#x5E73;&#x5B89;&#x591C;&#x5982;&#x4F55;&#x53EF;&#x4EE5;&#x8FC7;&#x5F97;&#x7EB8;&#x9189;&#x91D1;&#x8FF7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5979;&#x5E26;&#x6211;&#x53C2;&#x52A0;&#x5F53;&#x5730;&#x5DE5;&#x4F1A;&#x7EC4;&#x7EC7;&#x7684;&#x4E00;&#x5E74;&#x4E00;&#x5EA6;&#x5723;&#x8BDE;&#x591C;&#x514D;&#x8D39;&#x665A;&#x9910;&#x6D3B;&#x52A8;&#xFF0C;&#x6211;&#x4FE9;&#x5047;&#x88C5;&#x6210;&#x5FD7;&#x613F;&#x8005;&#x6DF7;&#x8FDB;&#x53BB;&#xFF0C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x5E03;&#x7F6E;&#x573A;&#x5730;&#xFF0C;&#x7ED9;&#x9700;&#x8981;&#x5723;&#x8BDE;&#x665A;&#x9910;&#x7684;&#x4EBA;&#x4EEC;&#x5206;&#x53D1;&#x98DF;&#x7269;&#x548C;&#x751F;&#x6D3B;&#x7269;&#x8D44;&#xFF0C;&#x5C0F;&#x5B69;&#x5B50;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x6392;&#x961F;&#x4E0A;&#x53F0;&#x62E5;&#x62B1;&#x5723;&#x8BDE;&#x8001;&#x4EBA;&#x5E76;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5723;&#x8BDE;&#x793C;&#x7269;&#x3002;&#x4EBA;&#x4EEC;&#x7684;&#x6E29;&#x9971;&#x95EE;&#x9898;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#xFF0C;&#x6574;&#x4E2A;&#x793C;&#x5802;&#x91CC;&#x9762;&#x542B;&#x60C5;&#x8109;&#x8109;&#x3002;&#x6709;&#x4E2A;&#x6D88;&#x7626;&#x7684;&#x5927;&#x53D4;&#x6765;&#x665A;&#x4E86;&#xFF0C;&#x770B;&#x5230;&#x5403;&#x7684;&#x4E1C;&#x897F;&#x88AB;&#x5206;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x8868;&#x60C5;&#x5F88;&#x96BE;&#x770B;&#x3002;&#x6211;&#x4E0A;&#x53BB;&#x5B89;&#x6170;&#x4ED6;&#x8BF4;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x4ED6;&#x77AA;&#x773C;&#x770B;&#x6211;&#xFF0C;&#x4E24;&#x4E2A;&#x773C;&#x73E0;&#x5B50;&#x5728;&#x4E00;&#x5F20;&#x7626;&#x8138;&#x4E0A;&#x663E;&#x5F97;&#x5DE8;&#x5927;&#xFF0C;&#x300C;&#x600E;&#x4E48;&#x6CA1;&#x5173;&#x7CFB;&#xFF1F;&#xFF01;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x662F;&#x6CA1;&#x5173;&#x7CFB;&#x2026;&#x300D;&#x8FD9;&#x4E00;&#x5E55;&#x5BF9;&#x5F53;&#x65F6;&#x7684;&#x6211;&#x9020;&#x6210;&#x4E86;&#x4E0D;&#x5C0F;&#x7684;&#x9707;&#x64BC;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x6211;&#x8FD8;&#x5904;&#x4E8E;&#x7231;&#x4E0A;&#x5C42;&#x697C;&#xFF0C;&#x53EA;&#x5403;&#x8FC7;&#x732A;&#x8089;&#x6CA1;&#x89C1;&#x8FC7;&#x732A;&#x8DD1;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x6211;&#x773C;&#x91CC;&#x65E0;&#x6BD4;&#x96BE;&#x5403;&#x7684;&#x98DF;&#x7269;&#xFF0C;&#x5BF9;&#x4E8E;&#x522B;&#x4EBA;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x8089;&#x98DF;&#x8005;&#x8C0B;&#x4E4B;&#xFF0C;&#x6211;&#x4ECE;&#x5C0F;&#x5403;&#x8089;&#x5305;&#x5B50;&#x957F;&#x5927;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x8C0B;&#x3002;&#x8089;&#x5403;&#x591A;&#x4E86;&#xFF0C;&#x53CD;&#x5012;&#x957F;&#x6210;&#x4E00;&#x4E2A;&#x72AC;&#x5112;&#x3002;&#x73A9;&#x4E16;&#x4E0D;&#x606D;&#xFF0C;&#x653F;&#x6CBB;&#x51B7;&#x611F;&#xFF0C;&#x91D1;&#x94B1;&#x81F3;&#x4E0A;&#xFF0C;&#x4EAB;&#x4E50;&#x4E3B;&#x4E49;&#x3002;&#x9047;&#x5230;&#x8150;&#x673D;&#x9F8C;&#x9F8A;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x50B2;&#x6162;&#x5730;&#x4F01;&#x56FE;&#x6539;&#x53D8;&#x5B83;&#x4EEC;&#xFF0C;&#x53EA;&#x662F;&#x9ED8;&#x9ED8;&#x7B49;&#x5F85;&#x5B83;&#x4EEC;&#x7684;&#x6B7B;&#x4EA1;&#x3002; </p>
<p>&#x53EF;&#x662F;&#x4EBA;&#x6B7B;&#x7684;&#x592A;&#x6162;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5B66;&#x6821;&#x8FB9;&#x4E0A;&#x6709;&#x6761;&#x6CB3;&#xFF0C;&#x6CB3;&#x8FB9;&#x6709;&#x4E2A;&#x516C;&#x56ED;&#xFF0C;&#x6709;&#x5927;&#x7247;&#x7684;&#x8349;&#x5730;&#xFF0C;&#x4E00;&#x4EBA;&#x73AF;&#x62B1;&#x7684;&#x5927;&#x6811;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x6563;&#x843D;&#x5728;&#x516C;&#x56ED;&#x91CC;&#x7684;&#x70E7;&#x70E4;&#x67B6;&#x3002;&#x5728;&#x8D85;&#x5E02;&#x4E70;&#x597D;&#x70AD;&#x706B;&#x3001;&#x70E4;&#x76D8;&#x548C;&#x814C;&#x597D;&#x7684;&#x5927;&#x8089;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6CB3;&#x8FB9;&#x6765;&#x4E00;&#x573A;&#x70E7;&#x70E4;&#x3002;&#x4E00;&#x4EBF;&#x5757;&#x725B;&#x6392;&#x548C;&#x4E24;&#x4EBF;&#x5757;&#x9E21;&#x6392;&#x5728;&#x70E4;&#x67B6;&#x4E0A;&#x53D1;&#x751F;&#x8FC7;&#x7F8E;&#x62C9;&#x5FB7;&#x53CD;&#x5E94;&#x4E4B;&#x540E;&#xFF0C;&#x70E4;&#x67B6;&#x53D8;&#x6210;&#x9ED1;&#x4E4E;&#x4E4E;&#x4E00;&#x7247;&#xFF0C;&#x9700;&#x4ED4;&#x7EC6;&#x8FA8;&#x8BA4;&#xFF0C;&#x624D;&#x80FD;&#x52C9;&#x5F3A;&#x611F;&#x53D7;&#x5230;&#x70E4;&#x67B6;&#x5F53;&#x521D;&#x88AB;&#x7AD6;&#x5728;&#x8349;&#x576A;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x79CD;&#x610F;&#x6C14;&#x98CE;&#x53D1;&#x3001;&#x8E0C;&#x8E87;&#x6EE1;&#x5FD7;&#x3002;&#x5728;&#x65B0;&#x6CFD;&#x897F;&#xFF0C;&#x6BCF;&#x4E2A;&#x5468;&#x672B;&#x90FD;&#x53EF;&#x4EE5;&#x6765;&#x70E4;&#x8089;&#xFF0C;&#x5982;&#x6B64;&#x6253;&#x8D25;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x88AB;&#x65F6;&#x95F4;&#x6253;&#x8D25;&#x3002; </p>
<p>&#x5728;&#x901A;&#x5F80;&#x90A3;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x97E9;&#x56FD;&#x8D85;&#x5E02;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x7D27;&#x8D34;&#x7740;&#x9A6C;&#x8DEF;&#x8FB9;&#xFF0C;&#x6709;&#x4E00;&#x680B;&#x5E74;&#x4EE3;&#x4E45;&#x8FDC;&#x7684;&#x5C0F;&#x623F;&#x5B50;&#xFF0C;&#x623F;&#x5B50;&#x7684;&#x73B0;&#x4EFB;&#x4E3B;&#x4EBA;&#x662F;&#x4E00;&#x4E2A;&#x7EA2;&#x8116;&#x5B50;&#x5927;&#x53D4;&#x3002;&#x6211;&#x4EEC;&#x89C1;&#x5230;&#x5927;&#x53D4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x53D4;&#x6B63;&#x5728;&#x81EA;&#x5DF1;&#x88C5;&#x4FEE;&#x6574;&#x680B;&#x623F;&#x5B50;&#xFF0C;&#x4E00;&#x8EAB;&#x6C61;&#x6E0D;&#xFF0C;&#x6EE1;&#x8138;&#x7279;&#x610F;&#x3002;&#x8BF4;&#x4F60;&#x4EEC;&#x8FC7;&#x4E00;&#x5468;&#x518D;&#x6765;&#x770B;&#x770B;&#xFF0C;&#x6574;&#x680B;&#x623F;&#x5B50;&#x5C31;&#x7115;&#x7136;&#x4E00;&#x65B0;&#x5566;&#x3002;&#x6211;&#x73AF;&#x89C6;&#x5BA2;&#x5385;&#x4E00;&#x5468;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5728;&#x73A9;&#x4F7F;&#x547D;&#x53EC;&#x5524;&#xFF0C;&#x5730;&#x677F;&#x7834;&#x8D25;&#x4E0D;&#x582A;&#xFF0C;&#x5899;&#x58C1;&#x548C;&#x7A97;&#x5B50;&#x4E5F;&#x88AB;&#x70B8;&#x70C2;&#x4E86;&#xFF0C;&#x8033;&#x8FB9;&#x54CD;&#x8D77;&#x67AA;&#x5F39;&#x58F0;&#x7206;&#x70B8;&#x58F0;&#x548C;&#x76F4;&#x5347;&#x673A;&#x87BA;&#x65CB;&#x6868;&#x7684;&#x9707;&#x52A8;&#xFF0C;&#x6211;&#x5BF9;&#x5927;&#x53D4;&#x7B11;&#x7B11;&#xFF1A;&#x201C;&#x6069;&#xFF0C;&#x5F53;&#x7136;&#x3002;&#x201D; &#x60F3;&#x5FC5;&#x8FD9;&#x5C0F;&#x623F;&#x5B50;&#x4E0D;&#x662F;&#x6545;&#x610F;&#x7D27;&#x8D34;&#x7740;&#x9A6C;&#x8DEF;&#x8FB9;&#x5EFA;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5927;&#x6982;&#x5F88;&#x591A;&#x5E74;&#x4E4B;&#x524D;&#xFF0C;&#x6709;&#x4EBA;&#x5728;&#x5F53;&#x65F6;&#x7684;&#x5C0F;&#x6751;&#x5B50;&#x91CC;&#x5EFA;&#x8D77;&#x8FD9;&#x6837;&#x4E00;&#x680B;&#x5C0F;&#x623F;&#x5B50;&#xFF0C;&#x4E00;&#x6761;&#x53EA;&#x80FD;&#x901A;&#x9A6C;&#x8F66;&#x7684;&#x9A6C;&#x8DEF;&#x7A7F;&#x8FC7;&#x6751;&#x5B50;&#x3002;&#x5728;&#x4E0D;&#x77E5;&#x591A;&#x5C11;&#x4E2A;&#x65B0;&#x5A74;&#x513F;&#x8BDE;&#x751F;&#xFF0C;&#x591A;&#x5C11;&#x4E2A;&#x5C11;&#x5E74;&#x6210;&#x957F;&#x4E3A;&#x5927;&#x53D4;&#xFF0C;&#x591A;&#x5C11;&#x4E2A;&#x8001;&#x5934;&#x8001;&#x592A;&#x592A;&#x6B7B;&#x53BB;&#x4E4B;&#x540E;&#xFF0C;&#x5C0F;&#x9A6C;&#x8DEF;&#x88AB;&#x62D3;&#x5BBD;&#x6210;&#x53CC;&#x5411;&#x56DB;&#x8F66;&#x9053;&#x7684;&#x65B0;&#x6CFD;&#x897F;&#x5DDE;27&#x53F7;&#x516C;&#x8DEF;&#x3002;&#x8981;&#x662F;&#x79DF;&#x4E86;&#x8FD9;&#x513F;&#x7684;&#x623F;&#x5B50;&#xFF0C;&#x54EA;&#x5929;&#x6211;&#x9AD8;&#x5174;&#x4E86;&#xFF0C;&#x63A8;&#x95E8;&#x51FA;&#x53BB;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6CE8;&#x610F;&#xFF0C;&#x811A;&#x5411;&#x524D;&#x591A;&#x4F38;&#x4E00;&#x5C3A;&#xFF0C;&#x5C31;&#x4F1A;&#x88AB;&#x8DEF;&#x4E0A;&#x8D85;&#x901F;&#x800C;&#x8FC7;&#x7684;&#x9053;&#x5947;&#x78BE;&#x6389;&#x5927;&#x811A;&#x8DBE;&#x3002; </p>
<p>&#x6240;&#x4EE5;&#x65F6;&#x95F4;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5728;&#x65B0;&#x6CFD;&#x897F;&#x8FD9;&#x5757;&#x513F;&#x5730;&#x4E0A;&#x7559;&#x4E0B;&#x75D5;&#x8FF9;&#x3002;&#x8001;&#x4EBA;&#x53BB;&#x4E16;&#x4E4B;&#x540E;&#xFF0C;&#x5E26;&#x7740;&#x9648;&#x65E7;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x4E00;&#x540C;&#x88AB;&#x57CB;&#x846C;&#x4E86;&#x3002;&#x59D1;&#x5A18;&#x5C0F;&#x4F19;&#x5B50;&#x4EEC;&#x9C9C;&#x5AE9;&#x7684;&#x8089;&#x4F53;&#x5E26;&#x7740;&#x65B0;&#x5947;&#x7684;&#x60F3;&#x6CD5;&#x5728;&#x82B1;&#x56ED;&#x91CC;&#x8DD1;&#x6765;&#x8DD1;&#x53BB;&#xFF0C;&#x8086;&#x65E0;&#x5FCC;&#x60EE;&#xFF0C;&#x4E0D;&#x7531;&#x5206;&#x8BF4;&#x3002;&#x7136;&#x540E;&#x6293;&#x4F4F;&#x5E76;&#x88AB;&#x6293;&#x4F4F;&#xFF0C;&#x521B;&#x9020;&#x5E76;&#x88AB;&#x521B;&#x9020;&#xFF0C;&#x63A7;&#x5236;&#x5E76;&#x88AB;&#x63A7;&#x5236;&#xFF0C;&#x7136;&#x540E;&#x957F;&#x5927;&#x6210;&#x4EBA;&#xFF0C;&#x6210;&#x4E3A;&#x793E;&#x4F1A;&#x4E2D;&#x575A;&#x3002;&#x4E00;&#x62E8;&#x4EBA;&#x5165;&#x571F;&#x4E4B;&#x540E;&#xFF0C;&#x4EBA;&#x7C7B;&#x7684;&#x60F3;&#x6CD5;&#x5C31;&#x518D;&#x6539;&#x53D8;&#x4E00;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x7B49;&#x4E0B;&#x53BB;&#x771F;&#x662F;&#x592A;&#x6162;&#x4E86;&#xFF0C;H &#x54E5;&#x53EF;&#x80FD;&#x7B49;&#x817B;&#x4E86;&#xFF0C;&#x4ED6;&#x8981;&#x79BB;&#x5F00;&#x65B0;&#x6CFD;&#x897F;&#x3002;&#x65B0;&#x5EFA;&#x7684;&#x6559;&#x5B66;&#x697C;&#x91CC;&#x9762;&#x88C5;&#x4FEE;&#x6C14;&#x5473;&#x5DF2;&#x7ECF;&#x6563;&#x5C3D;&#xFF0C;&#x8349;&#x5730;&#x91CC;&#x7C97;&#x58EE;&#x7684;&#x9E45;&#x5C4E;&#x4E5F;&#x88AB;&#x98CE;&#x5E72;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x300C;&#x65B0;&#x6CFD;&#x897F;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x611F;&#x5230;&#x5FC3;&#x4E71;&#x4E86;&#x3002;&#x300D;</p>
<p>&#x4ED6;&#x8BF4;&#x8FD9;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5750;&#x5728;&#x4E00;&#x4E2A;&#x5496;&#x5561;&#x5385;&#x91CC;&#xFF0C;&#x6211;&#x659C;&#x5BF9;&#x9762;&#x4E00;&#x59D1;&#x5A18;&#x76EE;&#x5149;&#x4E0D;&#x65AD;&#x4ECE;&#x684C;&#x4E0A;&#x7684;&#x751F;&#x7269;&#x5B66;&#x5927;&#x539A;&#x4E66;&#x4E0A;&#x79FB;&#x5F00;&#xFF0C;&#x8F6C;&#x5411;&#x7A97;&#x5916;&#x88AB;&#x98CE;&#x5E26;&#x7740;&#x6296;&#x52A8;&#x7684;&#x6811;&#x53F6;&#x548C;&#x6811;&#x53F6;&#x540E;&#x9762;&#x98D8;&#x5FFD;&#x4E0D;&#x5B9A;&#x7684;&#x4E91;&#x3002;H &#x54E5;&#x95EE;&#x6211;&#xFF0C;&#x6811;&#x53F6;&#x548C;&#x4E91;&#x7684;&#x8FD0;&#x52A8;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6A21;&#x5F0F;&#x53EF;&#x5FAA;&#xFF1F;&#x59D1;&#x5A18;&#x5FC3;&#x7EEA;&#x88AB;&#x4E0D;&#x540C;&#x4E8B;&#x7269;&#x6240;&#x7275;&#x5F15;&#x800C;&#x8F97;&#x8F6C;&#x53D8;&#x5316;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6A21;&#x5F0F;&#x53EF;&#x5FAA;&#xFF1F;&#x63A2;&#x5BFB;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x5BF9;&#x4EBA;&#x7C7B;&#x672A;&#x6765;&#x5343;&#x5E74;&#x7684;&#x4F11;&#x517B;&#x751F;&#x606F;&#x4F1A;&#x8D77;&#x5230;&#x54EA;&#x4E9B;&#x4F5C;&#x7528;&#xFF1F;&#x6211;&#x9762;&#x524D;&#x7684;&#x5496;&#x5561;&#x5DF2;&#x7ECF;&#x51B7;&#x4E86;&#xFF0C;&#x6211;&#x8FD8;&#x5728;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5728;&#x65B0;&#x6CFD;&#x897F;&#x5F00;&#x4E00;&#x5BB6;&#x5364;&#x716E;&#x706B;&#x70E7;&#x5E97;&#xFF0C;&#x5982;&#x4F55;&#x641E;&#x5230;&#x6700;&#x65B0;&#x9C9C;&#x7684;&#x732A;&#x4E0B;&#x6C34;&#xFF0C;&#x6700;&#x6B63;&#x5B97;&#x7684;&#x8C03;&#x6599;&#xFF0C;&#x7136;&#x540E;&#x5473;&#x9053;&#x8DB3;&#x591F;&#x8165;&#x81CA;&#x3002;&#x7F8E;&#x56FD;&#x51FA;&#x751F;&#x7684;&#x5C0F;&#x5B69;&#x5403;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5410;&#x6211;&#x4E00;&#x8EAB;&#xFF0C;&#x7136;&#x540E;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x4E2D;&#x9910;&#x3002;&#x6211;&#x51B3;&#x5B9A;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x6539;&#x53D8;&#xFF0C;&#x4E0D;&#x518D;&#x9759;&#x9759;&#x7B49;&#x4ED6;&#x4EEC;&#x6B7B;&#x53BB;&#x5F97;&#x4EE5;&#x4FDD;&#x5168;&#x81EA;&#x5DF1;&#x3002;&#x5982;&#x6B64;&#x50B2;&#x6162;&#xFF0C;&#x5982;&#x6B64;&#x6E29;&#x67D4;&#xFF0C;&#x5982;&#x6B64;&#x5584;&#x826F;&#xFF0C;&#x5982;&#x6B64;&#x70ED;&#x7231;&#x4E16;&#x754C;&#x3002; </p>
<p>&#x6211;&#x8DDF; H &#x54E5;&#x7684;&#x6DF1;&#x5165;&#x4EA4;&#x8C08;&#x6BCF;&#x6B21;&#x90FD;&#x5728;&#x5927;&#x96E8;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x5728;&#x5927;&#x9152;&#x4E4B;&#x540E;&#x3002;&#x5728;&#x4ED6;&#x8D70;&#x4E4B;&#x524D;&#xFF0C;&#x65B0;&#x6CFD;&#x897F;&#x4E0B;&#x4E86;&#x573A;&#x4E09;&#x5E74;&#x4E4B;&#x5185;&#x6700;&#x5927;&#x7684;&#x96E8;&#x3002;&#x6CB3;&#x5CB8;&#x4E24;&#x4FA7;&#x7684;&#x516C;&#x56ED;&#x88AB;&#x4E24;&#x5C3A;&#x6DF1;&#x7684;&#x96E8;&#x6C34;&#x6DF9;&#x4E86;&#xFF0C;&#x5C0F;&#x5154;&#x5B50;&#x7684;&#x5C38;&#x4F53;&#x88AB;&#x6076;&#x72E0;&#x72E0;&#x5730;&#x51B2;&#x5230;&#x4E0B;&#x6E38;&#x53BB;&#x3002;H &#x54E5;&#x5728;&#x542C;&#x5B8C;&#x6211;&#x8DDF;&#x5973;&#x53CB;&#x7684;&#x6545;&#x4E8B;&#x4E4B;&#x540E;&#xFF0C;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x7591;&#x95EE;&#xFF1A;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x7684;&#x59D1;&#x5A18;&#x662F;&#x5982;&#x4F55;&#x559C;&#x6B22;&#x4E0A;&#x4E00;&#x4E2A;&#x72AC;&#x5112;&#x4E3B;&#x4E49;&#x5C11;&#x5E74;&#x7684;&#xFF1F;&#x6211;&#x60F3;&#x4E86;&#x60F3;&#xFF0C;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x5C31;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x662F;&#x770B;&#x8138;&#x3002; </p>
<h1 id="gitbookonceuponatime">gitbook/OnceUponATime</h1>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Once Upon a Time">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"新泽西","level":"1.3.1","depth":2,"previous":{"title":"Once Upon a Time","level":"1.3","depth":1,"path":"onceuponatime/index.md","ref":"onceuponatime/index.md","articles":[{"title":"新泽西","level":"1.3.1","depth":2,"path":"onceuponatime/New Jersey.md","ref":"onceuponatime/New Jersey.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"onceuponatime/New Jersey.md","mtime":"2020-07-23T14:28:47.856Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-23T14:29:17.962Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

